---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\My Dropbox\Afrobarometer\NUNN_WANTCHEKON_AER_2011_REPLICATION_FILES\Altonji_Ratios_Table4.log
  log type:  text
 opened on:  16 Nov 2010, 11:10:36

. 
. use "Nunn_Wantchekon_AER_2011.dta", clear

. 
. local baseline_controls "age age2 male urban_dum i.education i.occupation i.religion i.living_conditions district_ethnic_frac f
> rac_ethnicity_in_district i.isocode"

. local colonial_controls "malaria_ecology total_missions_area explorer_contact railway_contact cities_1400_dum i.v30 v33"

. 
. ********************************
. *** Table 4 - Altonji Ratios ***
. ********************************
. 
. preserve

. foreach x in trust_relative trust_neighbors trust_local_council intra_group_trust inter_group_trust{
  2. 
. ********************
. *** Rows #1 & #3 ***
. ********************
. *******
. sum `x'
  3. *******
. * Full #1
. xi: reg `x' ln_export_area `baseline_controls', cluster(murdock_name)
  4. predict hat if e(sample), xb
  5. gen beta3=_b[ln_export_area]
  6. * Unrestricted #1
. xi: reg `x' ln_export_area i.isocode if missing(hat)!=1, cluster(murdock_name)
  7. gen beta1=_b[ln_export_area] if missing(hat)!=1
  8. * Unrestricted #2
. xi: reg `x' ln_export_area i.isocode age age2 male if missing(hat)!=1, cluster(murdock_name)
  9. gen beta2=_b[ln_export_area] if missing(hat)!=1
 10. * Row 1
. gen diff1_3=beta3/(beta1-beta3)
 11. * Row 3
. gen diff2_3=beta3/(beta2-beta3)
 12. drop beta*
 13. sum diff*
 14. drop hat
 15. drop diff*
 16. 
. ********************
. *** Rows #2 & #4 ***
. ********************
. * Full #2
. xi: reg `x' ln_export_area `baseline_controls' `colonial_controls' ln_init_pop_density, cluster(murdock_name)
 17. predict hat if e(sample), xb
 18. gen beta5=_b[ln_export_area]
 19. * Unrestricted #1
. xi: reg `x' ln_export_area i.isocode if missing(hat)!=1, cluster(murdock_name)
 20. gen beta1=_b[ln_export_area] if missing(hat)!=1
 21. * Unrestricted #2
. xi: reg `x' ln_export_area i.isocode age age2 male if missing(hat)!=1, cluster(murdock_name)
 22. gen beta2=_b[ln_export_area] if missing(hat)!=1
 23. * Row 2
. gen diff1_5=beta5/(beta1-beta5)
 24. * Row 4
. gen diff2_5=beta5/(beta2-beta5)
 25. drop beta*
 26. sum diff*
 27. drop hat
 28. drop diff*
 29. }

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
trust_rela~s |     20738    2.189073       .9581          0          3
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   20062
                                                       F( 77,   184) =   92.66
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1330
                                                       Root MSE      =  .89418

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_rela~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.133002   .0360069    -3.69   0.000    -.2040414   -.0619625
         age |  -.0029506   .0025007    -1.18   0.240    -.0078843    .0019831
        age2 |   .0000514   .0000267     1.93   0.055    -1.19e-06     .000104
        male |   .0194515   .0132128     1.47   0.143    -.0066165    .0455194
   urban_dum |   -.094624   .0211109    -4.48   0.000    -.1362745   -.0529735
_Ieducatio~1 |   .0277038   .0309633     0.89   0.372     -.033385    .0887926
_Ieducatio~2 |  -.0185588   .0249759    -0.74   0.458    -.0678347    .0307171
_Ieducatio~3 |  -.0726325   .0297527    -2.44   0.016    -.1313329   -.0139321
_Ieducatio~4 |  -.0863324   .0325261    -2.65   0.009    -.1505045   -.0221602
_Ieducatio~5 |  -.0947028   .0407677    -2.32   0.021    -.1751349   -.0142706
_Ieducatio~6 |  -.0982788    .044728    -2.20   0.029    -.1865244   -.0100331
_Ieducatio~7 |  -.1580362   .0596424    -2.65   0.009    -.2757071   -.0403654
_Ieducatio~8 |  -.0159502   .0854612    -0.19   0.852    -.1845601    .1526598
_Ieducatio~9 |  -.0121001   .0940416    -0.13   0.898    -.1976386    .1734385
_Ioccupat~_1 |   .0327204   .0366585     0.89   0.373    -.0396046    .1050453
_Ioccupat~_2 |   .0753672   .0393689     1.91   0.057    -.0023054    .1530397
_Ioccupat~_3 |   .0043304   .0642816     0.07   0.946    -.1224933    .1311541
_Ioccupat~_4 |   .0230979   .0585884     0.39   0.694    -.0924934    .1386893
_Ioccupat~_5 |   .0418376   .1051429     0.40   0.691    -.1656031    .2492783
_Ioccupat~_6 |  -.0591565    .036325    -1.63   0.105    -.1308237    .0125106
_Ioccupati~7 |  -.0576738   .0612058    -0.94   0.347    -.1784291    .0630815
_Ioccupat~_8 |   -.099351   .0553607    -1.79   0.074    -.2085744    .0098724
_Ioccupat~_9 |  -.0447192   .0744687    -0.60   0.549    -.1916414     .102203
_Ioccupat~10 |   .0391616   .0519111     0.75   0.452     -.063256    .1415792
_Ioccupat~11 |  -.0519189   .0493338    -1.05   0.294    -.1492515    .0454138
_Ioccupat~12 |  -.1143701   .0646056    -1.77   0.078    -.2418331    .0130929
_Ioccupat~13 |   .0346681   .0614512     0.56   0.573    -.0865714    .1559076
_Ioccupat~14 |  -.0166239   .0447059    -0.37   0.710    -.1048261    .0715783
_Ioccupat~15 |  -.1440305   .0588951    -2.45   0.015    -.2602271   -.0278339
_Ioccupat~16 |  -.0082196   .0524893    -0.16   0.876    -.1117779    .0953387
_Ioccupat~18 |  -.1034994   .0517917    -2.00   0.047    -.2056813   -.0013176
_Ioccupat~19 |  -.0863446   .0872261    -0.99   0.324    -.2584366    .0857473
_Ioccupat~20 |  -.0471116   .0460474    -1.02   0.308    -.1379604    .0437372
_Ioccupat~21 |   .0212804   .0546908     0.39   0.698    -.0866212     .129182
_Ioccupat~22 |  -.0140753   .0509335    -0.28   0.783     -.114564    .0864135
_Ioccupat~23 |  -.0053414   .0352258    -0.15   0.880    -.0748398    .0641569
_Ioccupat~24 |  -.0098602   .0369799    -0.27   0.790    -.0828194     .063099
_Ioccupat~25 |   .1607259   .1287022     1.25   0.213    -.0931959    .4146476
_Ioccupa~995 |  -.0603307   .0721729    -0.84   0.404    -.2027236    .0820621
_Ireligion_2 |    .026679   .0341118     0.78   0.435    -.0406215    .0939795
_Ireligion_3 |   .0759005   .0400957     1.89   0.060    -.0032059    .1550069
_Ireligion_4 |   .0338531   .0387422     0.87   0.383    -.0425831    .1102892
_Ireligion_5 |    .022299   .0592537     0.38   0.707    -.0946049     .139203
_Ireligion_6 |  -.0167109   .0695527    -0.24   0.810    -.1539342    .1205124
_Ireligion_7 |  -.3676468   .4137119    -0.89   0.375    -1.183876    .4485822
_Ireligio~10 |   .0314537   .0385028     0.82   0.415      -.04451    .1074173
_Ireligio~11 |   .1933342   .0449194     4.30   0.000      .104711    .2819575
_Ireligio~12 |   .1913479   .0590513     3.24   0.001     .0748433    .3078525
_Ireligio~13 |  -.0427311    .089511    -0.48   0.634     -.219331    .1338688
_Ireligio~14 |   .0130399   .0470149     0.28   0.782    -.0797176    .1057975
_Ireligio~15 |   .2933632   .0690422     4.25   0.000     .1571471    .4295794
_Ireligi~360 |   .1902307   .0695442     2.74   0.007     .0530242    .3274373
_Ireligi~361 |   .1934015   .0781188     2.48   0.014     .0392777    .3475252
_Ireligi~362 |   .4196492   .0713837     5.88   0.000     .2788134     .560485
_Ireligi~363 |   .1293621   .1159349     1.12   0.266    -.0993705    .3580948
_Ireligi~995 |   .0811655   .0730771     1.11   0.268    -.0630113    .2253424
_Iliving_c~2 |   .0780077   .0320466     2.43   0.016     .0147816    .1412338
_Iliving_c~3 |   .1019725   .0363062     2.81   0.006     .0303425    .1736025
_Iliving_c~4 |   .1305108   .0331323     3.94   0.000     .0651427    .1958789
_Iliving_c~5 |   .0717092   .0488738     1.47   0.144    -.0247159    .1681342
district_e~c |  -.0695968   .0590201    -1.18   0.240      -.18604    .0468463
frac_ethni~t |   .0243188   .0464256     0.52   0.601    -.0672761    .1159138
 _Iisocode_2 |   -.438608   .1582739    -2.77   0.006     -.750873   -.1263429
 _Iisocode_3 |   .1347668    .131261     1.03   0.306    -.1242034     .393737
 _Iisocode_4 |  -.1785439   .1619391    -1.10   0.272    -.4980402    .1409524
 _Iisocode_5 |  -.5337949   .1520704    -3.51   0.001    -.8338207   -.2337691
 _Iisocode_6 |  -.2064989   .1455592    -1.42   0.158    -.4936785    .0806808
 _Iisocode_7 |   .2239159   .1395078     1.61   0.110    -.0513247    .4991566
 _Iisocode_8 |   .3888386   .1493811     2.60   0.010     .0941186    .6835586
 _Iisocode_9 |    .253151   .1435682     1.76   0.080    -.0301005    .5364026
_Iisocode_10 |   .1460442   .1484538     0.98   0.327    -.1468463    .4389347
_Iisocode_11 |  -.1904047   .1444545    -1.32   0.189    -.4754048    .0945955
_Iisocode_12 |   .5742118   .1479272     3.88   0.000     .2823602    .8660634
_Iisocode_13 |   .1991972   .1509992     1.32   0.189    -.0987153    .4971097
_Iisocode_14 |  -.0939971   .1494145    -0.63   0.530    -.3887831    .2007889
_Iisocode_15 |  -.0590459   .1588544    -0.37   0.711    -.3724562    .2543645
_Iisocode_16 |  -.0318297   .1581169    -0.20   0.841    -.3437849    .2801255
_Iisocode_17 |  (omitted)
       _cons |   2.248875   .1625523    13.83   0.000     1.928169    2.569581
------------------------------------------------------------------------------
(1760 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   20062
                                                       F( 16,   184) =   37.47
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1151
                                                       Root MSE      =  .90202

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_rela~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.163883   .0438505    -3.74   0.000    -.2503974   -.0773686
 _Iisocode_2 |  -.6297852   .1717114    -3.67   0.000    -.9685615   -.2910089
 _Iisocode_3 |   .0750624   .1455566     0.52   0.607    -.2121122     .362237
 _Iisocode_4 |   -.262609    .182913    -1.44   0.153    -.6234854    .0982674
 _Iisocode_5 |  -.6952394   .1676853    -4.15   0.000    -1.026072   -.3644063
 _Iisocode_6 |  -.2617758   .1626454    -1.61   0.109    -.5826654    .0591139
 _Iisocode_7 |   .3213851   .1613215     1.99   0.048     .0031074    .6396629
 _Iisocode_8 |   .3602316   .1814698     1.99   0.049     .0022025    .7182608
 _Iisocode_9 |   .1855353   .1636991     1.13   0.259    -.1374332    .5085038
_Iisocode_10 |   .0063459   .1714485     0.04   0.971    -.3319118    .3446036
_Iisocode_11 |  -.1941422   .1615422    -1.20   0.231    -.5128554     .124571
_Iisocode_12 |   .6636614   .1549464     4.28   0.000     .3579614    .9693614
_Iisocode_13 |   .1580023     .16804     0.94   0.348    -.1735306    .4895352
_Iisocode_14 |  -.1733361   .1685837    -1.03   0.305    -.5059418    .1592696
_Iisocode_15 |  -.2210421   .1763166    -1.25   0.212    -.5689043      .12682
_Iisocode_16 |  -.2012389   .1738929    -1.16   0.249    -.5443192    .1418414
_Iisocode_17 |  (omitted)
       _cons |    2.35437   .1638401    14.37   0.000     2.031123    2.677617
------------------------------------------------------------------------------
(1760 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   20062
                                                       F( 19,   184) =   40.82
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1173
                                                       Root MSE      =  .90094

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_rela~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1648839   .0431834    -3.82   0.000    -.2500823   -.0796856
 _Iisocode_2 |  -.6356888   .1693556    -3.75   0.000    -.9698172   -.3015603
 _Iisocode_3 |   .0677679   .1436034     0.47   0.638     -.215553    .3510888
 _Iisocode_4 |  -.2592063   .1801013    -1.44   0.152    -.6145354    .0961228
 _Iisocode_5 |   -.717441   .1652955    -4.34   0.000    -1.043559   -.3913227
 _Iisocode_6 |  -.2638916    .160525    -1.64   0.102    -.5805978    .0528147
 _Iisocode_7 |   .3050949   .1589396     1.92   0.056    -.0084834    .6186732
 _Iisocode_8 |   .3655091   .1793729     2.04   0.043     .0116171    .7194012
 _Iisocode_9 |   .1904344   .1610987     1.18   0.239    -.1274037    .5082725
_Iisocode_10 |   .0139541   .1685357     0.08   0.934    -.3185568    .3464649
_Iisocode_11 |  -.1798447   .1587149    -1.13   0.259    -.4929797    .1332903
_Iisocode_12 |   .6615767   .1523458     4.34   0.000     .3610075     .962146
_Iisocode_13 |   .1621155   .1661093     0.98   0.330    -.1656083    .4898392
_Iisocode_14 |  -.1620306   .1658193    -0.98   0.330    -.4891822    .1651211
_Iisocode_15 |  -.2268528   .1736167    -1.31   0.193    -.5693883    .1156827
_Iisocode_16 |  -.1896374   .1716181    -1.10   0.271    -.5282296    .1489548
_Iisocode_17 |  (omitted)
         age |  -.0022801   .0021553    -1.06   0.291    -.0065324    .0019723
        age2 |   .0000588   .0000249     2.36   0.019     9.62e-06    .0001079
        male |   .0151649   .0121136     1.25   0.212    -.0087345    .0390643
       _cons |   2.338666   .1616739    14.47   0.000     2.019693    2.657639
------------------------------------------------------------------------------
(1760 missing values generated)
(1760 missing values generated)
(1760 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_3 |     20062    4.306918           0   4.306918   4.306918
     diff2_3 |     20062      4.1717           0     4.1717     4.1717
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
i.v30             _Iv30_1-8           (naturally coded; _Iv30_1 omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16709
                                                       F( 91,   146) = 6902.64
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1304
                                                       Root MSE      =  .88408

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_rela~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1783746   .0317956    -5.61   0.000    -.2412137   -.1155355
         age |  -.0034003   .0026206    -1.30   0.196    -.0085795    .0017789
        age2 |   .0000543   .0000278     1.96   0.052    -5.85e-07    .0001092
        male |   .0164333   .0149885     1.10   0.275    -.0131892    .0460558
   urban_dum |  -.1123778   .0219882    -5.11   0.000    -.1558342   -.0689215
_Ieducatio~1 |    .012943   .0369986     0.35   0.727     -.060179    .0860651
_Ieducatio~2 |  -.0056752   .0292483    -0.19   0.846    -.0634799    .0521295
_Ieducatio~3 |  -.0792472    .032812    -2.42   0.017    -.1440951   -.0143994
_Ieducatio~4 |  -.0845647   .0367678    -2.30   0.023    -.1572305   -.0118988
_Ieducatio~5 |  -.0741751   .0468693    -1.58   0.116    -.1668051    .0184548
_Ieducatio~6 |  -.0873109   .0493178    -1.77   0.079    -.1847799     .010158
_Ieducatio~7 |  -.1337687     .06712    -1.99   0.048    -.2664211   -.0011163
_Ieducatio~8 |   .0337493   .1025296     0.33   0.743    -.1688846    .2363832
_Ieducatio~9 |  -.0753846    .099802    -0.76   0.451    -.2726277    .1218586
_Ioccupat~_1 |   .0557378   .0406706     1.37   0.173    -.0246414    .1361171
_Ioccupat~_2 |   .0917369   .0422406     2.17   0.031     .0082549     .175219
_Ioccupat~_3 |   .0214927   .0685996     0.31   0.754    -.1140837    .1570692
_Ioccupat~_4 |   .0611965   .0654439     0.94   0.351    -.0681432    .1905362
_Ioccupat~_5 |   .0767732    .113875     0.67   0.501    -.1482832    .3018297
_Ioccupat~_6 |  -.0315545   .0375629    -0.84   0.402    -.1057917    .0426826
_Ioccupati~7 |  -.0325181   .0545948    -0.60   0.552    -.1404163    .0753801
_Ioccupat~_8 |  -.0568284   .0495643    -1.15   0.253    -.1547846    .0411277
_Ioccupat~_9 |  -.0302409    .085232    -0.35   0.723    -.1986888     .138207
_Ioccupat~10 |   .0871211   .0563005     1.55   0.124    -.0241482    .1983905
_Ioccupat~11 |   -.041879   .0518812    -0.81   0.421    -.1444141    .0606562
_Ioccupat~12 |  -.0548145   .0733937    -0.75   0.456    -.1998658    .0902368
_Ioccupat~13 |   .0346636   .0693121     0.50   0.618    -.1023211    .1716483
_Ioccupat~14 |   .0354407   .0483409     0.73   0.465    -.0600976    .1309791
_Ioccupat~15 |  -.1478748   .0547534    -2.70   0.008    -.2560865   -.0396631
_Ioccupat~16 |  -.0228051   .0566579    -0.40   0.688    -.1347807    .0891705
_Ioccupat~18 |  -.0941091   .0541835    -1.74   0.085    -.2011945    .0129762
_Ioccupat~19 |  -.0775504   .1030809    -0.75   0.453    -.2812739    .1261732
_Ioccupat~20 |  -.0356933   .0523459    -0.68   0.496    -.1391469    .0677602
_Ioccupat~21 |   .0489578   .0625668     0.78   0.435    -.0746958    .1726113
_Ioccupat~22 |   .0204016   .0555869     0.37   0.714    -.0894574    .1302605
_Ioccupat~23 |   .0224909   .0370973     0.61   0.545    -.0508262    .0958079
_Ioccupat~24 |   .0236229   .0382992     0.62   0.538    -.0520696    .0993154
_Ioccupat~25 |    .231813   .0920177     2.52   0.013     .0499542    .4136718
_Ioccupa~995 |  -.0618092   .0783915    -0.79   0.432    -.2167379    .0931194
_Ireligion_2 |   .0385815   .0393356     0.98   0.328    -.0391593    .1163222
_Ireligion_3 |   .0943717   .0453757     2.08   0.039     .0046937    .1840496
_Ireligion_4 |   .0522828   .0462072     1.13   0.260    -.0390386    .1436043
_Ireligion_5 |    .101912   .0585016     1.74   0.084    -.0137074    .2175314
_Ireligion_6 |   .0893701   .0542215     1.65   0.101    -.0177903    .1965305
_Ireligion_7 |   -.362477   .4666255    -0.78   0.439     -1.28469    .5597363
_Ireligio~10 |   .0526326   .0403999     1.30   0.195    -.0272115    .1324767
_Ireligio~11 |   .1403125   .0448273     3.13   0.002     .0517183    .2289067
_Ireligio~12 |   .1193737   .0700693     1.70   0.091    -.0191076    .2578549
_Ireligio~13 |  -.0143198   .0997544    -0.14   0.886    -.2114689    .1828293
_Ireligio~14 |   .0045648   .0502451     0.09   0.928    -.0947369    .1038665
_Ireligio~15 |   .2136388   .0779195     2.74   0.007      .059643    .3676345
_Ireligi~360 |   .1239519   .0687456     1.80   0.073    -.0119131    .2598169
_Ireligi~361 |   .0797615   .0613029     1.30   0.195    -.0413942    .2009173
_Ireligi~362 |    .335176   .0774374     4.33   0.000     .1821329    .4882191
_Ireligi~363 |   .0858309    .135383     0.63   0.527    -.1817326    .3533945
_Ireligi~995 |     .11181   .0734904     1.52   0.130    -.0334324    .2570524
_Iliving_c~2 |   .0693261   .0354079     1.96   0.052    -.0006522    .1393044
_Iliving_c~3 |    .085204   .0397679     2.14   0.034     .0066088    .1637992
_Iliving_c~4 |   .1080692   .0363761     2.97   0.003     .0361775    .1799608
_Iliving_c~5 |   .0425552   .0532997     0.80   0.426    -.0627835    .1478938
district_e~c |  -.0005278   .0649143    -0.01   0.994    -.1288208    .1277653
frac_ethni~t |   .0822048   .0513263     1.60   0.111    -.0192337    .1836433
 _Iisocode_2 |   -.336316   .1513457    -2.22   0.028    -.6354275   -.0372046
 _Iisocode_3 |   .1595527   .0932118     1.71   0.089    -.0246661    .3437714
 _Iisocode_4 |  -.2097604   .1525653    -1.37   0.171    -.5112821    .0917613
 _Iisocode_5 |  -.4940737   .1501452    -3.29   0.001    -.7908126   -.1973348
 _Iisocode_6 |  -.2376571   .1370763    -1.73   0.085    -.5085672     .033253
 _Iisocode_7 |   .0546245   .1141852     0.48   0.633    -.1710448    .2802939
 _Iisocode_8 |   .4248015   .1557999     2.73   0.007      .116887    .7327159
 _Iisocode_9 |   .2949871   .1397328     2.11   0.036     .0188269    .5711474
_Iisocode_10 |   .1314356   .1459401     0.90   0.369    -.1569925    .4198637
_Iisocode_11 |  -.2893507   .1128376    -2.56   0.011    -.5123567   -.0663446
_Iisocode_12 |   .5150806   .1129308     4.56   0.000     .2918904    .7382709
_Iisocode_13 |   .2210815   .1554806     1.42   0.157     -.086202    .5283649
_Iisocode_14 |  -.0809135   .1454856    -0.56   0.579    -.3684434    .2066164
_Iisocode_15 |  -.0093791   .1437618    -0.07   0.948    -.2935021    .2747438
_Iisocode_16 |  -.0610622   .1616987    -0.38   0.706    -.3806347    .2585102
_Iisocode_17 |  (omitted)
malaria_ec~y |    .003207   .0034667     0.93   0.356    -.0036443    .0100583
total_miss~a |   51.65381   70.00909     0.74   0.462    -86.70834     190.016
explorer_c~t |  -.0331427   .0370854    -0.89   0.373    -.1064363    .0401509
railway_co~t |   .0114829   .0386109     0.30   0.767    -.0648255    .0877913
cities_140~m |   .2337541   .0494486     4.73   0.000     .1360265    .3314816
     _Iv30_2 |   .3790205   .1555947     2.44   0.016     .0715116    .6865295
     _Iv30_3 |   .3900626   .1358495     2.87   0.005     .1215771    .6585482
     _Iv30_4 |   .1941739   .1379623     1.41   0.161    -.0784873     .466835
     _Iv30_5 |   .2812287   .1113355     2.53   0.013     .0611913    .5012661
     _Iv30_6 |    .276109   .1075695     2.57   0.011     .0635145    .4887035
     _Iv30_7 |    .310445   .1047003     2.97   0.004     .1035211     .517369
     _Iv30_8 |    .415551   .1648654     2.52   0.013     .0897199     .741382
         v33 |  -.0194205   .0182555    -1.06   0.289    -.0554996    .0166586
ln_init_po~y |  -.0242658   .0256826    -0.94   0.346    -.0750236     .026492
       _cons |   2.000658   .1477804    13.54   0.000     1.708593    2.292723
------------------------------------------------------------------------------
(5113 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16709
                                                       F( 16,   146) =  141.50
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1058
                                                       Root MSE      =  .89449

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_rela~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1938288    .043179    -4.49   0.000    -.2791655   -.1084922
 _Iisocode_2 |  -.6152267   .1587518    -3.88   0.000    -.9289752   -.3014782
 _Iisocode_3 |   .0969188   .1254408     0.77   0.441    -.1509956    .3448332
 _Iisocode_4 |  -.3541057   .1684799    -2.10   0.037    -.6870802   -.0211313
 _Iisocode_5 |  -.7340034   .1457195    -5.04   0.000    -1.021995   -.4460113
 _Iisocode_6 |  -.3092483   .1460609    -2.12   0.036    -.5979152   -.0205814
 _Iisocode_7 |   .2525955   .1459343     1.73   0.086    -.0358212    .5410122
 _Iisocode_8 |   .3169885   .1740555     1.82   0.071    -.0270054    .6609824
 _Iisocode_9 |   .1877176   .1383199     1.36   0.177    -.0856503    .4610855
_Iisocode_10 |  -.0471539   .1525475    -0.31   0.758    -.3486405    .2543326
_Iisocode_11 |  -.2230482   .1446991    -1.54   0.125    -.5090237    .0629272
_Iisocode_12 |   .6497088   .1357008     4.79   0.000     .3815171    .9179005
_Iisocode_13 |   .0921876   .1503315     0.61   0.541    -.2049195    .3892946
_Iisocode_14 |  -.2403693   .1514702    -1.59   0.115    -.5397267    .0589882
_Iisocode_15 |  -.2743962   .1621694    -1.69   0.093     -.594899    .0461065
_Iisocode_16 |  -.2860626   .1580135    -1.81   0.072    -.5983518    .0262266
_Iisocode_17 |  (omitted)
       _cons |    2.42874   .1456833    16.67   0.000      2.14082    2.716661
------------------------------------------------------------------------------
(5113 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16709
                                                       F( 19,   146) =  137.51
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1081
                                                       Root MSE      =  .89344

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_rela~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.194698   .0424342    -4.59   0.000    -.2785628   -.1108333
 _Iisocode_2 |  -.6212265   .1558557    -3.99   0.000    -.9292514   -.3132017
 _Iisocode_3 |   .0890573   .1239192     0.72   0.473    -.1558498    .3339644
 _Iisocode_4 |  -.3508019    .165557    -2.12   0.036    -.6779997    -.023604
 _Iisocode_5 |  -.7555728   .1427238    -5.29   0.000    -1.037644   -.4735012
 _Iisocode_6 |  -.3103039   .1439789    -2.16   0.033     -.594856   -.0257518
 _Iisocode_7 |   .2357829   .1434753     1.64   0.102    -.0477738    .5193397
 _Iisocode_8 |   .3255908   .1724858     1.89   0.061    -.0153007    .6664823
 _Iisocode_9 |   .1929404   .1356987     1.42   0.157    -.0752471    .4611279
_Iisocode_10 |  -.0398047   .1497496    -0.27   0.791    -.3357616    .2561522
_Iisocode_11 |  -.2082658   .1418703    -1.47   0.144    -.4886505    .0721188
_Iisocode_12 |   .6469669   .1333123     4.85   0.000     .3834956    .9104381
_Iisocode_13 |   .0966005   .1486269     0.65   0.517    -.1971376    .3903386
_Iisocode_14 |  -.2280642   .1487257    -1.53   0.127    -.5219975    .0658691
_Iisocode_15 |  -.2802571   .1594627    -1.76   0.081    -.5954104    .0348963
_Iisocode_16 |  -.2738814   .1559831    -1.76   0.081    -.5821581    .0343952
_Iisocode_17 |  (omitted)
         age |  -.0021128   .0023019    -0.92   0.360    -.0066621    .0024365
        age2 |   .0000574   .0000274     2.10   0.037     3.38e-06    .0001115
        male |   .0104119   .0136785     0.76   0.448    -.0166216    .0374455
       _cons |   2.410968   .1412964    17.06   0.000     2.131717    2.690219
------------------------------------------------------------------------------
(5113 missing values generated)
(5113 missing values generated)
(5113 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_5 |     16709    11.54216           0   11.54216   11.54216
     diff2_5 |     16709    10.92754           0   10.92754   10.92754

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
trust_neig~s |     20698    1.738477    1.010104          0          3
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   20027
                                                       F( 77,   184) =   79.83
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1562
                                                       Root MSE      =  .92728

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_neig~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1592648    .033888    -4.70   0.000    -.2261238   -.0924058
         age |   .0083527   .0024661     3.39   0.001     .0034873    .0132181
        age2 |  -.0000541   .0000279    -1.94   0.054    -.0001091    9.24e-07
        male |   .0457985   .0133499     3.43   0.001     .0194599    .0721371
   urban_dum |  -.1446862   .0265295    -5.45   0.000    -.1970273   -.0923451
_Ieducatio~1 |   .0231457   .0333691     0.69   0.489    -.0426896     .088981
_Ieducatio~2 |  -.0510999   .0226097    -2.26   0.025    -.0957075   -.0064924
_Ieducatio~3 |  -.1355438   .0297674    -4.55   0.000    -.1942731   -.0768144
_Ieducatio~4 |  -.1869935   .0284554    -6.57   0.000    -.2431343   -.1308526
_Ieducatio~5 |  -.1880522     .03837    -4.90   0.000     -.263754   -.1123504
_Ieducatio~6 |   -.242281   .0451975    -5.36   0.000     -.331453   -.1531091
_Ieducatio~7 |  -.2761396   .0494942    -5.58   0.000    -.3737886   -.1784905
_Ieducatio~8 |  -.1167282   .0647853    -1.80   0.073    -.2445458    .0110893
_Ieducatio~9 |  -.2367982   .1052171    -2.25   0.026    -.4443853   -.0292111
_Ioccupat~_1 |   .0568048    .037771     1.50   0.134    -.0177151    .1313247
_Ioccupat~_2 |   .0687846    .045541     1.51   0.133     -.021065    .1586343
_Ioccupat~_3 |   .0262399    .075867     0.35   0.730    -.1234411    .1759209
_Ioccupat~_4 |   .0045756   .0577415     0.08   0.937     -.109345    .1184961
_Ioccupat~_5 |   .0664701   .1276918     0.52   0.603    -.1854583    .3183985
_Ioccupat~_6 |  -.0782245    .038942    -2.01   0.046    -.1550547   -.0013942
_Ioccupati~7 |   .0149145   .0582971     0.26   0.798    -.1001023    .1299313
_Ioccupat~_8 |  -.0984016   .0643306    -1.53   0.128    -.2253221    .0285189
_Ioccupat~_9 |  -.1029427   .0666327    -1.54   0.124     -.234405    .0285196
_Ioccupat~10 |  -.0365743   .0524917    -0.70   0.487    -.1401373    .0669886
_Ioccupat~11 |  -.0259126    .046449    -0.56   0.578    -.1175538    .0657285
_Ioccupat~12 |  -.1521819   .0610974    -2.49   0.014    -.2727234   -.0316405
_Ioccupat~13 |  -.0167688   .0689728    -0.24   0.808    -.1528481    .1193105
_Ioccupat~14 |  -.0623903   .0519852    -1.20   0.232     -.164954    .0401733
_Ioccupat~15 |   -.230741   .0580088    -3.98   0.000    -.3451889   -.1162931
_Ioccupat~16 |  -.0160171   .0556322    -0.29   0.774    -.1257761    .0937418
_Ioccupat~18 |  -.1774178    .049495    -3.58   0.000    -.2750684   -.0797671
_Ioccupat~19 |   -.169648   .0968488    -1.75   0.081    -.3607249     .021429
_Ioccupat~20 |  -.0287529   .0438432    -0.66   0.513     -.115253    .0577472
_Ioccupat~21 |  -.0515676    .060629    -0.85   0.396    -.1711851    .0680499
_Ioccupat~22 |  -.1089929   .0559908    -1.95   0.053    -.2194594    .0014736
_Ioccupat~23 |  -.1019134   .0342816    -2.97   0.003    -.1695489   -.0342779
_Ioccupat~24 |   .0092787    .040227     0.23   0.818    -.0700868    .0886441
_Ioccupat~25 |   .0219574   .1834714     0.12   0.905    -.3400208    .3839355
_Ioccupa~995 |  -.0067955   .0867741    -0.08   0.938    -.1779956    .1644046
_Ireligion_2 |   .0564613   .0336518     1.68   0.095    -.0099316    .1228543
_Ireligion_3 |   .0811745   .0394422     2.06   0.041     .0033573    .1589917
_Ireligion_4 |   .0538655   .0411881     1.31   0.193    -.0273962    .1351273
_Ireligion_5 |   .0401295   .0522964     0.77   0.444    -.0630482    .1433073
_Ireligion_6 |  -.0173504   .0607972    -0.29   0.776    -.1372997     .102599
_Ireligion_7 |  -.0397158   .3861227    -0.10   0.918    -.8015128    .7220813
_Ireligio~10 |   .0587308   .0397151     1.48   0.141    -.0196248    .1370864
_Ireligio~11 |   .2123832   .0607898     3.49   0.001     .0924487    .3323178
_Ireligio~12 |   .2403312   .0694794     3.46   0.001     .1032524      .37741
_Ireligio~13 |  -.0642767   .0998899    -0.64   0.521    -.2613534    .1328001
_Ireligio~14 |   .0451986   .0474215     0.95   0.342    -.0483611    .1387583
_Ireligio~15 |   .3424478   .0846925     4.04   0.000     .1753545    .5095411
_Ireligi~360 |   .3643269   .1138076     3.20   0.002     .1397913    .5888625
_Ireligi~361 |   .3855249   .1145971     3.36   0.001     .1594316    .6116182
_Ireligi~362 |   .8334575   .2018675     4.13   0.000     .4351848     1.23173
_Ireligi~363 |   .3142702   .1789861     1.76   0.081    -.0388587    .6673991
_Ireligi~995 |   .0374402   .0770464     0.49   0.628    -.1145677     .189448
_Iliving_c~2 |   .0441221   .0317261     1.39   0.166    -.0184716    .1067159
_Iliving_c~3 |   .0856088   .0316992     2.70   0.008     .0230681    .1481496
_Iliving_c~4 |     .11895   .0342204     3.48   0.001     .0514353    .1864647
_Iliving_c~5 |     .11695    .052116     2.24   0.026     .0141282    .2197717
district_e~c |  -.0061163   .0665655    -0.09   0.927    -.1374462    .1252135
frac_ethni~t |   .1004617   .0537988     1.87   0.063    -.0056801    .2066035
 _Iisocode_2 |  -.4404296   .1480957    -2.97   0.003    -.7326137   -.1482456
 _Iisocode_3 |   .0640714   .1261816     0.51   0.612    -.1848774    .3130202
 _Iisocode_4 |  -.1847428   .1509722    -1.22   0.223    -.4826019    .1131163
 _Iisocode_5 |  -.5692328    .147549    -3.86   0.000    -.8603381   -.2781275
 _Iisocode_6 |  -.3140095    .136843    -2.29   0.023    -.5839927   -.0440264
 _Iisocode_7 |   .0670726   .1372863     0.49   0.626    -.2037852    .3379304
 _Iisocode_8 |   .1042014   .1507393     0.69   0.490    -.1931983    .4016012
 _Iisocode_9 |   .3304538    .135615     2.44   0.016     .0628936    .5980141
_Iisocode_10 |   -.154909   .1432412    -1.08   0.281    -.4375154    .1276973
_Iisocode_11 |  -.1826221   .1324881    -1.38   0.170    -.4440133    .0787691
_Iisocode_12 |   .4650183   .1585338     2.93   0.004     .1522406    .7777961
_Iisocode_13 |   .2298951   .1480207     1.55   0.122     -.062141    .5219311
_Iisocode_14 |  -.0706201   .1510788    -0.47   0.641    -.3686896    .2274494
_Iisocode_15 |   -.227254   .1557723    -1.46   0.146    -.5345834    .0800754
_Iisocode_16 |  -.2254389   .1501939    -1.50   0.135    -.5217625    .0708847
_Iisocode_17 |  (omitted)
       _cons |   1.631659   .1572842    10.37   0.000     1.321347    1.941971
------------------------------------------------------------------------------
(1795 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   20027
                                                       F( 16,   184) =   43.31
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1169
                                                       Root MSE      =  .94719

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_neig~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.196888   .0454909    -4.33   0.000    -.2866388   -.1071372
 _Iisocode_2 |  -.7133131   .1738728    -4.10   0.000    -1.056354   -.3702724
 _Iisocode_3 |  -.0286534   .1463407    -0.20   0.845    -.3173748     .260068
 _Iisocode_4 |  -.3252134   .1835503    -1.77   0.078    -.6873472    .0369203
 _Iisocode_5 |  -.7594525   .1731778    -4.39   0.000    -1.101122    -.417783
 _Iisocode_6 |  -.4059064   .1644058    -2.47   0.014    -.7302693   -.0815436
 _Iisocode_7 |   .1836435   .1629396     1.13   0.261    -.1378268    .5051137
 _Iisocode_8 |   .0483294   .2004898     0.24   0.810     -.347225    .4438838
 _Iisocode_9 |   .2490392   .1610236     1.55   0.124    -.0686507    .5667291
_Iisocode_10 |  -.3733376   .1757614    -2.12   0.035    -.7201044   -.0265708
_Iisocode_11 |  -.2715625   .1640656    -1.66   0.100    -.5952542    .0521292
_Iisocode_12 |   .6820514   .1483203     4.60   0.000     .3894242    .9746785
_Iisocode_13 |   .1605008    .176528     0.91   0.364    -.1877784      .50878
_Iisocode_14 |  -.2166909   .1815037    -1.19   0.234    -.5747869    .1414052
_Iisocode_15 |  -.4627503   .1866784    -2.48   0.014    -.8310556   -.0944449
_Iisocode_16 |   -.477165   .1752857    -2.72   0.007    -.8229932   -.1313368
_Iisocode_17 |  (omitted)
       _cons |   2.030757   .1684016    12.06   0.000      1.69851    2.363003
------------------------------------------------------------------------------
(1795 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   20027
                                                       F( 19,   184) =   64.28
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1260
                                                       Root MSE      =  .94238

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_neig~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1992055   .0443945    -4.49   0.000    -.2867933   -.1116177
 _Iisocode_2 |  -.7157099   .1691226    -4.23   0.000    -1.049379   -.3820412
 _Iisocode_3 |   -.045785    .142273    -0.32   0.748    -.3264811    .2349111
 _Iisocode_4 |  -.3160243   .1780906    -1.77   0.078    -.6673864    .0353379
 _Iisocode_5 |  -.7947687   .1680671    -4.73   0.000    -1.126355   -.4631823
 _Iisocode_6 |  -.4179895   .1600692    -2.61   0.010    -.7337966   -.1021824
 _Iisocode_7 |   .1498938   .1580739     0.95   0.344    -.1619767    .4617642
 _Iisocode_8 |   .0609821   .1959921     0.31   0.756    -.3256986    .4476629
 _Iisocode_9 |   .2684783   .1561834     1.72   0.087    -.0396623    .5766188
_Iisocode_10 |  -.3516022   .1699014    -2.07   0.040    -.6868076   -.0163968
_Iisocode_11 |   -.228194   .1589608    -1.44   0.153    -.5418142    .0854263
_Iisocode_12 |    .676814   .1433857     4.72   0.000     .3939225    .9597055
_Iisocode_13 |   .1613199   .1725877     0.93   0.351    -.1791854    .5018252
_Iisocode_14 |  -.1870963   .1749209    -1.07   0.286    -.5322049    .1580122
_Iisocode_15 |  -.4758501   .1812795    -2.62   0.009    -.8335038   -.1181964
_Iisocode_16 |  -.4537698   .1705435    -2.66   0.008     -.790242   -.1172977
_Iisocode_17 |  (omitted)
         age |   .0114596   .0024447     4.69   0.000     .0066364    .0162827
        age2 |  -.0000563   .0000284    -1.99   0.049    -.0001123   -3.61e-07
        male |   .0186595   .0134946     1.38   0.168    -.0079645    .0452834
       _cons |   1.686943   .1707285     9.88   0.000     1.350106     2.02378
------------------------------------------------------------------------------
(1795 missing values generated)
(1795 missing values generated)
(1795 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_3 |     20027     4.23315           0    4.23315    4.23315
     diff2_3 |     20027    3.987528           0   3.987528   3.987528
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
i.v30             _Iv30_1-8           (naturally coded; _Iv30_1 omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16679
                                                       F( 91,   146) = 8567.67
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1598
                                                       Root MSE      =  .91052

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_neig~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.2019601   .0299135    -6.75   0.000    -.2610796   -.1428407
         age |   .0070233   .0025959     2.71   0.008     .0018929    .0121538
        age2 |  -.0000403   .0000292    -1.38   0.169     -.000098    .0000174
        male |   .0442845   .0143665     3.08   0.002     .0158913    .0726777
   urban_dum |   -.153471   .0280828    -5.46   0.000    -.2089724   -.0979696
_Ieducatio~1 |   .0186676   .0379721     0.49   0.624    -.0563783    .0937135
_Ieducatio~2 |  -.0327263    .025725    -1.27   0.205    -.0835678    .0181153
_Ieducatio~3 |  -.1267029   .0353189    -3.59   0.000    -.1965053   -.0569004
_Ieducatio~4 |  -.1755974   .0329326    -5.33   0.000    -.2406836   -.1105111
_Ieducatio~5 |  -.1495353   .0424819    -3.52   0.001    -.2334941   -.0655764
_Ieducatio~6 |  -.2332812   .0516545    -4.52   0.000    -.3353683   -.1311941
_Ieducatio~7 |  -.2625428   .0573619    -4.58   0.000    -.3759097   -.1491759
_Ieducatio~8 |  -.0858564   .0777904    -1.10   0.272    -.2395971    .0678842
_Ieducatio~9 |  -.2025934   .1297542    -1.56   0.121    -.4590326    .0538459
_Ioccupat~_1 |   .0602775   .0402211     1.50   0.136    -.0192134    .1397683
_Ioccupat~_2 |   .0630666   .0477733     1.32   0.189    -.0313499    .1574831
_Ioccupat~_3 |  -.0052388   .0784017    -0.07   0.947    -.1601877    .1497102
_Ioccupat~_4 |   .0262288   .0623265     0.42   0.674    -.0969498    .1494075
_Ioccupat~_5 |   .0773866   .1408507     0.55   0.584    -.2009832    .3557563
_Ioccupat~_6 |  -.0776986    .039619    -1.96   0.052    -.1559995    .0006023
_Ioccupati~7 |    .018542   .0581061     0.32   0.750    -.0962957    .1333797
_Ioccupat~_8 |  -.1043076    .064636    -1.61   0.109    -.2320506    .0234354
_Ioccupat~_9 |  -.1386156   .0825075    -1.68   0.095     -.301679    .0244478
_Ioccupat~10 |  -.0302153   .0579579    -0.52   0.603    -.1447602    .0843296
_Ioccupat~11 |  -.0365903   .0429914    -0.85   0.396    -.1215563    .0483756
_Ioccupat~12 |  -.0824888   .0655467    -1.26   0.210    -.2120317     .047054
_Ioccupat~13 |  -.0271252   .0769198    -0.35   0.725    -.1791452    .1248948
_Ioccupat~14 |  -.0626003   .0524561    -1.19   0.235    -.1662718    .0410711
_Ioccupat~15 |    -.24862   .0548896    -4.53   0.000    -.3571008   -.1401391
_Ioccupat~16 |  -.0349382    .061577    -0.57   0.571    -.1566356    .0867592
_Ioccupat~18 |  -.1871341    .054008    -3.46   0.001    -.2938726   -.0803956
_Ioccupat~19 |  -.0923741   .1031427    -0.90   0.372    -.2962198    .1114715
_Ioccupat~20 |  -.0313561   .0477045    -0.66   0.512    -.1256368    .0629246
_Ioccupat~21 |  -.0402255   .0662084    -0.61   0.544    -.1710763    .0906253
_Ioccupat~22 |  -.0658417   .0585761    -1.12   0.263    -.1816082    .0499249
_Ioccupat~23 |  -.0770676   .0339553    -2.27   0.025     -.144175   -.0099602
_Ioccupat~24 |   .0300072   .0426681     0.70   0.483    -.0543197     .114334
_Ioccupat~25 |   .0499242   .1620733     0.31   0.758    -.2703887    .3702371
_Ioccupa~995 |  -.0254506   .0946507    -0.27   0.788    -.2125131    .1616119
_Ireligion_2 |   .0540055   .0376554     1.43   0.154    -.0204145    .1284256
_Ireligion_3 |   .0884288    .045563     1.94   0.054    -.0016194    .1784771
_Ireligion_4 |   .0566616   .0462081     1.23   0.222    -.0346615    .1479847
_Ireligion_5 |    .081852   .0592872     1.38   0.170      -.03532    .1990239
_Ireligion_6 |   .0469377    .056078     0.84   0.404    -.0638919    .1577673
_Ireligion_7 |  -.0600018   .4387914    -0.14   0.891    -.9272053    .8072017
_Ireligio~10 |    .083117    .042295     1.97   0.051    -.0004726    .1667066
_Ireligio~11 |   .1441578    .057414     2.51   0.013     .0306879    .2576277
_Ireligio~12 |   .1486371   .0864982     1.72   0.088    -.0223132    .3195873
_Ireligio~13 |  -.1022573   .1210767    -0.84   0.400    -.3415468    .1370321
_Ireligio~14 |   .0212711   .0510769     0.42   0.678    -.0796745    .1222167
_Ireligio~15 |   .2336529    .076861     3.04   0.003     .0817489    .3855569
_Ireligi~360 |   .3272428   .1332076     2.46   0.015     .0639787     .590507
_Ireligi~361 |   .3293668   .1426279     2.31   0.022     .0474848    .6112487
_Ireligi~362 |   .7420689   .3139414     2.36   0.019     .1216122    1.362526
_Ireligi~363 |   .3346163    .224152     1.49   0.138    -.1083855    .7776181
_Ireligi~995 |  -.0067989   .0866883    -0.08   0.938    -.1781248    .1645271
_Iliving_c~2 |   .0301186   .0345608     0.87   0.385    -.0381855    .0984227
_Iliving_c~3 |    .073817   .0351725     2.10   0.038     .0043039      .14333
_Iliving_c~4 |   .0895661   .0374574     2.39   0.018     .0155373    .1635948
_Iliving_c~5 |   .0996524   .0560528     1.78   0.078    -.0111273    .2104321
district_e~c |   .0297111    .077862     0.38   0.703    -.1241713    .1835934
frac_ethni~t |   .1412789   .0613029     2.30   0.023     .0201232    .2624347
 _Iisocode_2 |  -.4157475   .1444852    -2.88   0.005    -.7013001   -.1301949
 _Iisocode_3 |   .0615224   .0943665     0.65   0.515    -.1249783    .2480231
 _Iisocode_4 |  -.2623832   .1392131    -1.88   0.061    -.5375163      .01275
 _Iisocode_5 |  -.5593346   .1647381    -3.40   0.001    -.8849139   -.2337552
 _Iisocode_6 |  -.3445386   .1184759    -2.91   0.004     -.578688   -.1103892
 _Iisocode_7 |  -.0841738   .1123791    -0.75   0.455    -.3062738    .1379261
 _Iisocode_8 |    .132845   .1297141     1.02   0.307    -.1235148    .3892048
 _Iisocode_9 |   .3242573   .1159388     2.80   0.006     .0951221    .5533925
_Iisocode_10 |  -.1913561   .1472015    -1.30   0.196    -.4822771     .099565
_Iisocode_11 |  -.2786984   .1052921    -2.65   0.009     -.486792   -.0706047
_Iisocode_12 |   .3188392   .1680295     1.90   0.060    -.0132453    .6509236
_Iisocode_13 |   .2307003   .1372227     1.68   0.095    -.0404993    .5018998
_Iisocode_14 |  -.0681596   .1353466    -0.50   0.615    -.3356513    .1993321
_Iisocode_15 |  -.2365438   .1765585    -1.34   0.182    -.5854845    .1123968
_Iisocode_16 |  -.3189323   .1480226    -2.15   0.033    -.6114762   -.0263884
_Iisocode_17 |  (omitted)
malaria_ec~y |   .0012416   .0034985     0.35   0.723    -.0056727    .0081559
total_miss~a |   20.43829   54.30919     0.38   0.707    -86.89544     127.772
explorer_c~t |  -.0412725   .0457278    -0.90   0.368    -.1316464    .0491014
railway_co~t |   .0277312   .0459622     0.60   0.547     -.063106    .1185684
cities_140~m |   .1998211    .062627     3.19   0.002     .0760485    .3235938
     _Iv30_2 |   .3540703   .1942528     1.82   0.070    -.0298404     .737981
     _Iv30_3 |   .3307677   .1560527     2.12   0.036     .0223536    .6391818
     _Iv30_4 |   .2389243    .155322     1.54   0.126    -.0680456    .5458941
     _Iv30_5 |   .2422253   .1272623     1.90   0.059    -.0092891    .4937397
     _Iv30_6 |    .249439   .1257876     1.98   0.049     .0008391    .4980388
     _Iv30_7 |   .2985757   .1339243     2.23   0.027     .0338951    .5632563
     _Iv30_8 |   .5093122   .1781735     2.86   0.005     .1571798    .8614446
         v33 |  -.0337823   .0205824    -1.64   0.103    -.0744603    .0068957
ln_init_po~y |  -.0222634    .026728    -0.83   0.406    -.0750873    .0305604
       _cons |   1.554076   .1648053     9.43   0.000     1.228363    1.879788
------------------------------------------------------------------------------
(5143 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16679
                                                       F( 16,   146) =  211.10
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1148
                                                       Root MSE      =  .93247

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_neig~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.230874   .0446457    -5.17   0.000    -.3191094   -.1426386
 _Iisocode_2 |  -.7318586   .1703905    -4.30   0.000    -1.068609    -.395108
 _Iisocode_3 |  -.0011981   .1246797    -0.01   0.992    -.2476083    .2452121
 _Iisocode_4 |  -.4369675   .1678856    -2.60   0.010    -.7687674   -.1051676
 _Iisocode_5 |    -.80273    .151849    -5.29   0.000    -1.102836   -.5026239
 _Iisocode_6 |  -.4433043    .145144    -3.05   0.003     -.730159   -.1564495
 _Iisocode_7 |   .1068603   .1485914     0.72   0.473    -.1868076    .4005282
 _Iisocode_8 |   .0061974   .1572779     0.04   0.969     -.304638    .3170328
 _Iisocode_9 |   .2176823   .1385049     1.57   0.118    -.0560513     .491416
_Iisocode_10 |  -.4251626   .1577215    -2.70   0.008    -.7368748   -.1134503
_Iisocode_11 |    -.30054   .1438635    -2.09   0.038    -.5848639    -.016216
_Iisocode_12 |   .6376332   .1370315     4.65   0.000     .3668115    .9084548
_Iisocode_13 |   .0862744   .1607274     0.54   0.592    -.2313784    .4039273
_Iisocode_14 |  -.2939594   .1675309    -1.75   0.081    -.6250583    .0371396
_Iisocode_15 |  -.5285265   .1751201    -3.02   0.003    -.8746243   -.1824287
_Iisocode_16 |  -.5829332   .1587242    -3.67   0.000    -.8966271   -.2692393
_Iisocode_17 |  (omitted)
       _cons |   2.115011    .151824    13.93   0.000     1.814954    2.415067
------------------------------------------------------------------------------
(5143 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16679
                                                       F( 19,   146) =  201.11
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1236
                                                       Root MSE      =  .92795

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_neig~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.2329412   .0434052    -5.37   0.000    -.3187248   -.1471575
 _Iisocode_2 |  -.7311312   .1651314    -4.43   0.000    -1.057488   -.4047745
 _Iisocode_3 |  -.0184567   .1211273    -0.15   0.879    -.2578461    .2209328
 _Iisocode_4 |  -.4288484   .1619844    -2.65   0.009    -.7489857   -.1087112
 _Iisocode_5 |  -.8378657   .1463485    -5.73   0.000    -1.127101   -.5486305
 _Iisocode_6 |  -.4513729   .1401427    -3.22   0.002    -.7283434   -.1744024
 _Iisocode_7 |   .0726108   .1436598     0.51   0.614    -.2113106    .3565323
 _Iisocode_8 |   .0252584   .1513902     0.17   0.868    -.2739409    .3244577
 _Iisocode_9 |   .2362275   .1335226     1.77   0.079    -.0276593    .5001142
_Iisocode_10 |  -.4059191   .1521333    -2.67   0.008    -.7065869   -.1052512
_Iisocode_11 |  -.2586393   .1386199    -1.87   0.064    -.5326002    .0153215
_Iisocode_12 |    .631114   .1324841     4.76   0.000     .3692796    .8929485
_Iisocode_13 |   .0882591   .1569287     0.56   0.575    -.2218863    .3984045
_Iisocode_14 |  -.2637989   .1607131    -1.64   0.103    -.5814235    .0538258
_Iisocode_15 |  -.5409183   .1696678    -3.19   0.002    -.8762405   -.2055961
_Iisocode_16 |  -.5591149    .154104    -3.63   0.000    -.8636776   -.2545521
_Iisocode_17 |  (omitted)
         age |   .0098738   .0025643     3.85   0.000     .0048059    .0149417
        age2 |  -.0000397   .0000296    -1.34   0.182    -.0000983    .0000188
        male |   .0148412   .0149259     0.99   0.322    -.0146576      .04434
       _cons |   1.805099    .153915    11.73   0.000      1.50091    2.109288
------------------------------------------------------------------------------
(5143 missing values generated)
(5143 missing values generated)
(5143 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_5 |     16679    6.984894           0   6.984894   6.984894
     diff2_5 |     16679    6.518827           0   6.518827   6.518827

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
trust_loca~l |     20323    1.665404    1.103241          0          3
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   19733
                                                       F( 78,   184) =  149.29
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1960
                                                       Root MSE      =  .98912

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.110552   .0215919    -5.12   0.000    -.1531515   -.0679526
         age |   .0034203   .0027695     1.23   0.218    -.0020437    .0088843
        age2 |  -.0000185   .0000312    -0.59   0.554    -.0000801    .0000431
        male |  -.0098602   .0155533    -0.63   0.527    -.0405459    .0208254
   urban_dum |  -.1892143    .025946    -7.29   0.000    -.2404043   -.1380243
_Ieducatio~1 |  -.0410246   .0464168    -0.88   0.378    -.1326022     .050553
_Ieducatio~2 |     .00278    .027457     0.10   0.919    -.0513911    .0569511
_Ieducatio~3 |  -.0731692    .032668    -2.24   0.026    -.1376212   -.0087171
_Ieducatio~4 |  -.1513425   .0327443    -4.62   0.000     -.215945   -.0867399
_Ieducatio~5 |  -.1717542    .039494    -4.35   0.000    -.2496734    -.093835
_Ieducatio~6 |   -.284521   .0445009    -6.39   0.000    -.3723186   -.1967233
_Ieducatio~7 |  -.2187347   .0600254    -3.64   0.000    -.3371612   -.1003081
_Ieducatio~8 |  -.2610211   .0955197    -2.73   0.007    -.4494757   -.0725665
_Ieducatio~9 |  -.3241764   .1042007    -3.11   0.002    -.5297581   -.1185946
_Ioccupat~_1 |    .093057   .0378532     2.46   0.015      .018375     .167739
_Ioccupat~_2 |   .0740857   .0389134     1.90   0.058    -.0026881    .1508596
_Ioccupat~_3 |   .0239341   .0816933     0.29   0.770     -.137242    .1851102
_Ioccupat~_4 |   .0646935   .0672052     0.96   0.337    -.0678983    .1972854
_Ioccupat~_5 |  -.1491382   .0664629    -2.24   0.026    -.2802656   -.0180109
_Ioccupat~_6 |  -.0381713   .0358667    -1.06   0.289    -.1089342    .0325915
_Ioccupati~7 |   .0228872   .0817797     0.28   0.780    -.1384594    .1842337
_Ioccupat~_8 |  -.0707311   .0612225    -1.16   0.249    -.1915194    .0500573
_Ioccupat~_9 |   .0505154   .0624423     0.81   0.420    -.0726796    .1737104
_Ioccupat~10 |  -.1213959   .0604454    -2.01   0.046    -.2406512   -.0021406
_Ioccupat~11 |   .0212172   .0363941     0.58   0.561    -.0505863    .0930206
_Ioccupat~12 |  -.0528504   .0638295    -0.83   0.409    -.1787822    .0730814
_Ioccupat~13 |   .0485997   .0614891     0.79   0.430    -.0727147     .169914
_Ioccupat~14 |  -.0315027   .0519444    -0.61   0.545    -.1339858    .0709805
_Ioccupat~15 |   -.028029   .0438916    -0.64   0.524    -.1146245    .0585664
_Ioccupat~16 |   .0033443   .0635993     0.05   0.958    -.1221333    .1288219
_Ioccupat~18 |  -.0973361   .0547696    -1.78   0.077    -.2053932    .0107211
_Ioccupat~19 |   .0615128    .107244     0.57   0.567    -.1500732    .2730989
_Ioccupat~20 |   .0055095   .0448749     0.12   0.902    -.0830259    .0940449
_Ioccupat~21 |   .0612468   .0473838     1.29   0.198    -.0322387    .1547322
_Ioccupat~22 |   .0860312   .0646771     1.33   0.185     -.041573    .2136353
_Ioccupat~23 |  -.0842458   .0389322    -2.16   0.032    -.1610568   -.0074348
_Ioccupat~24 |   .0570927   .0386591     1.48   0.141    -.0191793    .1333647
_Ioccupat~25 |   .1903456   .1442241     1.32   0.189    -.0941999    .4748911
_Ioccupa~995 |   .1313757    .103436     1.27   0.206    -.0726974    .3354488
_Ireligion_2 |   .0441927   .0358964     1.23   0.220    -.0266288    .1150142
_Ireligion_3 |   .0723665   .0354387     2.04   0.043      .002448     .142285
_Ireligion_4 |   .0392717   .0423869     0.93   0.355    -.0443551    .1228984
_Ireligion_5 |   .0804201   .0650371     1.24   0.218    -.0478942    .2087344
_Ireligion_6 |  -.0437007   .0555657    -0.79   0.433    -.1533285    .0659271
_Ireligion_7 |   .2352608   .3129934     0.75   0.453    -.3822565    .8527781
_Ireligio~10 |  -.0140048   .0407216    -0.34   0.731    -.0943461    .0663365
_Ireligio~11 |   .1737307   .0479693     3.62   0.000     .0790901    .2683713
_Ireligio~12 |   .1710306   .0728888     2.35   0.020     .0272253    .3148358
_Ireligio~13 |  -.1194107   .0892701    -1.34   0.183    -.2955353    .0567139
_Ireligio~14 |  -.0752607   .0599832    -1.25   0.211    -.1936041    .0430826
_Ireligio~15 |   .0062093   .0745492     0.08   0.934    -.1408718    .1532904
_Ireligi~360 |   .5385649   .0808664     6.66   0.000     .3790202    .6981095
_Ireligi~361 |   .3932954   .1171243     3.36   0.001      .162216    .6243747
_Ireligi~362 |   1.061611   .1522216     6.97   0.000     .7612872    1.361935
_Ireligi~363 |   .6908213   .1255175     5.50   0.000     .4431827    .9384599
_Ireligi~995 |   .0431551   .1128143     0.38   0.703    -.1794207     .265731
_Iliving_c~2 |    .122599   .0317773     3.86   0.000     .0599043    .1852937
_Iliving_c~3 |   .2012378   .0371723     5.41   0.000      .127899    .2745767
_Iliving_c~4 |   .2767544   .0402015     6.88   0.000     .1974393    .3560695
_Iliving_c~5 |    .298332   .0705388     4.23   0.000     .1591631    .4375009
district_e~c |   .1179878   .0641924     1.84   0.068      -.00866    .2446355
frac_ethni~t |    .112476   .0477831     2.35   0.020     .0182028    .2067492
 _Iisocode_2 |  -.0189214   .0872821    -0.22   0.829    -.1911238     .153281
 _Iisocode_3 |  -.1089648    .066522    -1.64   0.103    -.2402087     .022279
 _Iisocode_4 |  -.6665845   .0921721    -7.23   0.000    -.8484345   -.4847345
 _Iisocode_5 |  -.2363665   .1073552    -2.20   0.029    -.4481719   -.0245612
 _Iisocode_6 |  -.4648286   .0911272    -5.10   0.000    -.6446172     -.28504
 _Iisocode_7 |  -.0070393    .093781    -0.08   0.940    -.1920636    .1779851
 _Iisocode_8 |   .2556429   .1195772     2.14   0.034     .0197242    .4915616
 _Iisocode_9 |   -.196299    .094567    -2.08   0.039    -.3828741   -.0097239
_Iisocode_10 |  -.2635959   .0935509    -2.82   0.005    -.4481663   -.0790255
_Iisocode_11 |  -.9204067   .0740495   -12.43   0.000    -1.066502   -.7743113
_Iisocode_12 |     -.4123   .1360874    -3.03   0.003    -.6807923   -.1438077
_Iisocode_13 |   .3314273   .0950449     3.49   0.001     .1439094    .5189453
_Iisocode_14 |    .117675   .0923865     1.27   0.204    -.0645981    .2999481
_Iisocode_15 |  -.4747697   .1143646    -4.15   0.000    -.7004043   -.2491351
_Iisocode_16 |  -.6536971   .0998089    -6.55   0.000    -.8506141   -.4567802
_Iisocode_17 |  -.6968769   .0915173    -7.61   0.000    -.8774351   -.5163187
       _cons |   1.732627   .1135242    15.26   0.000     1.508651    1.956604
------------------------------------------------------------------------------
(2089 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   19733
                                                       F( 17,   184) =  104.89
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1629
                                                       Root MSE      =  1.0077

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1470591   .0306273    -4.80   0.000    -.2074849   -.0866333
 _Iisocode_2 |  -.1920893   .1286337    -1.49   0.137     -.445876    .0616973
 _Iisocode_3 |  -.1819198   .1056026    -1.72   0.087    -.3902675    .0264279
 _Iisocode_4 |  -.7486308   .1352944    -5.53   0.000    -1.015559   -.4817029
 _Iisocode_5 |  -.2995663   .1379535    -2.17   0.031    -.5717404   -.0273923
 _Iisocode_6 |  -.4465543   .1282236    -3.48   0.001    -.6995319   -.1935768
 _Iisocode_7 |   .1446912   .1267842     1.14   0.255    -.1054466    .3948289
 _Iisocode_8 |    .265856   .1793001     1.48   0.140    -.0878923    .6196044
 _Iisocode_9 |  -.2266063   .1294662    -1.75   0.082    -.4820354    .0288228
_Iisocode_10 |   -.367155   .1424682    -2.58   0.011    -.6482363   -.0860737
_Iisocode_11 |  -1.023889   .1108656    -9.24   0.000     -1.24262   -.8051577
_Iisocode_12 |   .0115717   .1172952     0.10   0.922    -.2198447    .2429882
_Iisocode_13 |   .3493241   .1324698     2.64   0.009     .0879692    .6106791
_Iisocode_14 |   .0717709   .1324415     0.54   0.589    -.1895282      .33307
_Iisocode_15 |  -.6498473   .1524239    -4.26   0.000    -.9505706    -.349124
_Iisocode_16 |  -.8349403   .1353896    -6.17   0.000    -1.102056   -.5678248
_Iisocode_17 |  -.9402016   .1280435    -7.34   0.000    -1.192824   -.6875794
       _cons |   2.078861   .1266096    16.42   0.000     1.829068    2.328654
------------------------------------------------------------------------------
(2089 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   19733
                                                       F( 20,   184) =  112.61
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1660
                                                       Root MSE      =  1.0059

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.148815    .029829    -4.99   0.000    -.2076658   -.0899642
 _Iisocode_2 |  -.1943306   .1253371    -1.55   0.123    -.4416133     .052952
 _Iisocode_3 |  -.1939617   .1021654    -1.90   0.059    -.3955279    .0076045
 _Iisocode_4 |  -.7434986   .1311532    -5.67   0.000    -1.002256   -.4847412
 _Iisocode_5 |   -.328014   .1354716    -2.42   0.016    -.5952915   -.0607365
 _Iisocode_6 |  -.4534817   .1242039    -3.65   0.000    -.6985287   -.2084347
 _Iisocode_7 |   .1224961   .1233159     0.99   0.322     -.120799    .3657911
 _Iisocode_8 |   .2757613    .176164     1.57   0.119    -.0717997    .6233224
 _Iisocode_9 |  -.2121552   .1256128    -1.69   0.093    -.4599817    .0356714
_Iisocode_10 |  -.3540676   .1377873    -2.57   0.011    -.6259138   -.0822214
_Iisocode_11 |  -.9963337    .106639    -9.34   0.000    -1.206726   -.7859414
_Iisocode_12 |   .0105284   .1145752     0.09   0.927    -.2155216    .2365785
_Iisocode_13 |   .3495521   .1289635     2.71   0.007     .0951148    .6039893
_Iisocode_14 |   .0905365   .1294055     0.70   0.485     -.164773    .3458459
_Iisocode_15 |  -.6589732   .1483508    -4.44   0.000    -.9516607   -.3662858
_Iisocode_16 |  -.8189123    .132079    -6.20   0.000    -1.079496   -.5583283
_Iisocode_17 |  -.9424147   .1248796    -7.55   0.000    -1.188795   -.6960347
         age |   .0064713     .00268     2.41   0.017     .0011838    .0117588
        age2 |  -.0000253   .0000297    -0.85   0.396    -.0000839    .0000333
        male |  -.0376847   .0155502    -2.42   0.016    -.0683644    -.007005
       _cons |   1.899173   .1365409    13.91   0.000     1.629786     2.16856
------------------------------------------------------------------------------
(2089 missing values generated)
(2089 missing values generated)
(2089 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_3 |     19733    3.028238           0   3.028238   3.028238
     diff2_3 |     19733    2.889272           0   2.889272   2.889272
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
i.v30             _Iv30_1-8           (naturally coded; _Iv30_1 omitted)

Linear regression                                      Number of obs =   15905
                                                       F( 92,   145) = 2760.34
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2057
                                                       Root MSE      =  .97738

                         (Std. Err. adjusted for 146 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1287867   .0211064    -6.10   0.000    -.1705027   -.0870707
         age |   .0034995   .0030866     1.13   0.259    -.0026012    .0096001
        age2 |  -.0000236   .0000359    -0.66   0.513    -.0000945    .0000474
        male |  -.0078002    .017308    -0.45   0.653    -.0420088    .0264083
   urban_dum |  -.1629831   .0307331    -5.30   0.000    -.2237258   -.1022404
_Ieducatio~1 |  -.0446325   .0507193    -0.88   0.380    -.1448772    .0556123
_Ieducatio~2 |  -.0181833   .0327133    -0.56   0.579    -.0828398    .0464732
_Ieducatio~3 |  -.0835257   .0322623    -2.59   0.011    -.1472908   -.0197607
_Ieducatio~4 |  -.1552855   .0368701    -4.21   0.000    -.2281578   -.0824133
_Ieducatio~5 |  -.1615357   .0369834    -4.37   0.000    -.2346318   -.0884395
_Ieducatio~6 |  -.2639067   .0421612    -6.26   0.000    -.3472365   -.1805768
_Ieducatio~7 |  -.1660309    .060891    -2.73   0.007    -.2863795   -.0456823
_Ieducatio~8 |  -.2253423   .1084765    -2.08   0.040    -.4397417   -.0109429
_Ieducatio~9 |  -.4090108   .1249922    -3.27   0.001    -.6560529   -.1619687
_Ioccupat~_1 |   .1083186   .0407786     2.66   0.009     .0277212    .1889159
_Ioccupat~_2 |   .0960835     .04254     2.26   0.025     .0120049    .1801622
_Ioccupat~_3 |  -.0022302   .0833331    -0.03   0.979    -.1669347    .1624743
_Ioccupat~_4 |   .1057201   .0713762     1.48   0.141     -.035352    .2467922
_Ioccupat~_5 |  -.1464246   .0655729    -2.23   0.027    -.2760268   -.0168225
_Ioccupat~_6 |  -.0092733    .038245    -0.24   0.809    -.0848629    .0663164
_Ioccupati~7 |     .02478   .1031553     0.24   0.810    -.1791022    .2286623
_Ioccupat~_8 |   -.056985   .0635398    -0.90   0.371    -.1825689     .068599
_Ioccupat~_9 |   .0664373   .0709299     0.94   0.350    -.0737527    .2066273
_Ioccupat~10 |  -.0706321   .0659789    -1.07   0.286    -.2010366    .0597724
_Ioccupat~11 |   .0455204   .0404656     1.12   0.262    -.0344584    .1254991
_Ioccupat~12 |    -.01979   .0750511    -0.26   0.792    -.1681255    .1285455
_Ioccupat~13 |   .0464427   .0612156     0.76   0.449    -.0745475    .1674329
_Ioccupat~14 |  -.0345212     .05053    -0.68   0.496    -.1343917    .0653493
_Ioccupat~15 |  -.0159535   .0489021    -0.33   0.745    -.1126065    .0806995
_Ioccupat~16 |   .0326639   .0733876     0.45   0.657    -.1123836    .1777115
_Ioccupat~18 |  -.0741462   .0685136    -1.08   0.281    -.2095606    .0612682
_Ioccupat~19 |    .044524   .1280861     0.35   0.729    -.2086331     .297681
_Ioccupat~20 |   .0029456   .0477169     0.06   0.951     -.091365    .0972562
_Ioccupat~21 |   .0884315   .0529626     1.67   0.097    -.0162469    .1931098
_Ioccupat~22 |   .1004893   .0708743     1.42   0.158    -.0395909    .2405695
_Ioccupat~23 |  -.0647356   .0400867    -1.61   0.109    -.1439653    .0144941
_Ioccupat~24 |   .0742889   .0461843     1.61   0.110    -.0169924    .1655702
_Ioccupat~25 |   .2862325   .1881609     1.52   0.130    -.0856599    .6581249
_Ioccupa~995 |   .1984373   .1099041     1.81   0.073    -.0187837    .4156582
_Ireligion_2 |   .0439777   .0439946     1.00   0.319    -.0429758    .1309312
_Ireligion_3 |    .055192   .0420633     1.31   0.192    -.0279445    .1383285
_Ireligion_4 |   .0262477   .0498011     0.53   0.599    -.0721821    .1246775
_Ireligion_5 |   .0624293   .0680734     0.92   0.361    -.0721151    .1969737
_Ireligion_6 |  -.0082693   .0719573    -0.11   0.909      -.15049    .1339515
_Ireligion_7 |   .0742879   .3092313     0.24   0.810    -.5368952    .6854711
_Ireligio~10 |  -.0037992   .0500414    -0.08   0.940     -.102704    .0951057
_Ireligio~11 |   .1386852   .0509667     2.72   0.007     .0379516    .2394187
_Ireligio~12 |   .0636299   .0846505     0.75   0.453    -.1036783    .2309382
_Ireligio~13 |  -.1565426   .0991393    -1.58   0.117    -.3524875    .0394023
_Ireligio~14 |  -.1027038   .0677681    -1.52   0.132    -.2366446     .031237
_Ireligio~15 |   .0046372   .0793794     0.06   0.953     -.152253    .1615274
_Ireligi~360 |   .5303175   .0668421     7.93   0.000     .3982068    .6624282
_Ireligi~361 |   .3752893   .1010226     3.71   0.000     .1756222    .5749563
_Ireligi~362 |    1.13924   .1241885     9.17   0.000     .8937864    1.384694
_Ireligi~363 |   .7947182   .0848087     9.37   0.000     .6270972    .9623393
_Ireligi~995 |   .0074467    .122589     0.06   0.952    -.2348455    .2497389
_Iliving_c~2 |   .1150541   .0369446     3.11   0.002     .0420345    .1880736
_Iliving_c~3 |   .1785273   .0425652     4.19   0.000      .094399    .2626556
_Iliving_c~4 |   .2473883   .0449294     5.51   0.000     .1585871    .3361894
_Iliving_c~5 |   .2758228   .0795085     3.47   0.001     .1186775    .4329681
district_e~c |   .1250141    .062821     1.99   0.048     .0008509    .2491773
frac_ethni~t |   .1260934   .0497226     2.54   0.012     .0278187    .2243682
 _Iisocode_2 |  -.1790541    .139299    -1.29   0.201     -.454373    .0962647
 _Iisocode_3 |  -.1601818   .0703502    -2.28   0.024    -.2992261   -.0211375
 _Iisocode_4 |   -.802242   .1244725    -6.45   0.000    -1.048257   -.5562271
 _Iisocode_5 |  -.2056214   .1641207    -1.25   0.212    -.5299993    .1187564
 _Iisocode_6 |  -.5671122   .1280375    -4.43   0.000    -.8201731   -.3140513
 _Iisocode_7 |  -.1096834   .1000035    -1.10   0.275    -.3073363    .0879694
 _Iisocode_8 |   .1885104   .1617632     1.17   0.246     -.131208    .5082288
 _Iisocode_9 |  -.3620536   .1345199    -2.69   0.008    -.6279267   -.0961805
_Iisocode_10 |  -.3761589   .1446256    -2.60   0.010    -.6620056   -.0903122
_Iisocode_11 |  -.9852904   .0845944   -11.65   0.000    -1.152488    -.818093
_Iisocode_12 |  -.4424228    .112716    -3.93   0.000    -.6652014   -.2196442
_Iisocode_13 |   .1357838   .1328933     1.02   0.309    -.1268745    .3984421
_Iisocode_14 |   -.083648    .116129    -0.72   0.472    -.3131724    .1458763
_Iisocode_15 |  -.6009145   .1323764    -4.54   0.000    -.8625512   -.3392778
_Iisocode_16 |  -.8414759   .1548384    -5.43   0.000    -1.147508   -.5354441
_Iisocode_17 |  -1.019692   .1434678    -7.11   0.000     -1.30325   -.7361334
malaria_ec~y |  -.0026256   .0038834    -0.68   0.500    -.0103009    .0050497
total_miss~a |    40.4039   47.78846     0.85   0.399    -54.04806    134.8559
explorer_c~t |   .1034736   .0413244     2.50   0.013     .0217976    .1851497
railway_co~t |  -.0740786    .037557    -1.97   0.050    -.1483084    .0001512
cities_140~m |   .0567698   .0559404     1.01   0.312    -.0537941    .1673336
     _Iv30_2 |  -.2453629   .3729772    -0.66   0.512    -.9825373    .4918115
     _Iv30_3 |   .1603108   .1132519     1.42   0.159     -.063527    .3841486
     _Iv30_4 |    .083627   .1096502     0.76   0.447    -.1330921    .3003462
     _Iv30_5 |   .2127909   .0962881     2.21   0.029     .0224814    .4031004
     _Iv30_6 |   .1559028   .0971611     1.60   0.111    -.0361322    .3479377
     _Iv30_7 |   .1615513   .0879001     1.84   0.068    -.0121797    .3352824
     _Iv30_8 |   .2627694   .0997838     2.63   0.009     .0655507     .459988
         v33 |   .0027395   .0145234     0.19   0.851    -.0259653    .0314444
ln_init_po~y |  -.0100215   .0220281    -0.45   0.650    -.0535592    .0335162
       _cons |   1.691295   .1447942    11.68   0.000     1.405115    1.977475
------------------------------------------------------------------------------
(5917 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   15905
                                                       F( 17,   145) = 1200.31
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1759
                                                       Root MSE      =  .99319

                         (Std. Err. adjusted for 146 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1774775   .0277201    -6.40   0.000    -.2322652   -.1226898
 _Iisocode_2 |   -.299532   .1174472    -2.55   0.012    -.5316615   -.0674024
 _Iisocode_3 |  -.1722451   .0843165    -2.04   0.043    -.3388932    -.005597
 _Iisocode_4 |  -.8177246   .1200082    -6.81   0.000    -1.054916   -.5805333
 _Iisocode_5 |  -.3217524   .1086936    -2.96   0.004    -.5365809   -.1069239
 _Iisocode_6 |   -.525812   .1152582    -4.56   0.000    -.7536153   -.2980088
 _Iisocode_7 |   .0817951   .1136768     0.72   0.473    -.1428825    .3064727
 _Iisocode_8 |   .2566803   .1576269     1.63   0.106    -.0548629    .5682234
 _Iisocode_9 |  -.2654903   .1095224    -2.42   0.017    -.4819569   -.0490236
_Iisocode_10 |  -.3971603   .1146298    -3.46   0.001    -.6237214   -.1705992
_Iisocode_11 |  -1.055773   .0909422   -11.61   0.000    -1.235516   -.8760292
_Iisocode_12 |    -.01312   .1026253    -0.13   0.898    -.2159547    .1897148
_Iisocode_13 |   .2838705   .1158535     2.45   0.015     .0548908    .5128503
_Iisocode_14 |  -.0123912   .1157051    -0.11   0.915    -.2410776    .2162952
_Iisocode_15 |  -.7521897   .1344325    -5.60   0.000     -1.01789   -.4864894
_Iisocode_16 |  -.9275778   .1198782    -7.74   0.000    -1.164512   -.6906434
_Iisocode_17 |   -1.09367   .1087197   -10.06   0.000     -1.30855   -.8787901
       _cons |   2.155854   .1086502    19.84   0.000     1.941111    2.370597
------------------------------------------------------------------------------
(5917 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   15905
                                                       F( 20,   145) = 1102.90
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1782
                                                       Root MSE      =  .99188

                         (Std. Err. adjusted for 146 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1789261   .0268361    -6.67   0.000    -.2319666   -.1258856
 _Iisocode_2 |  -.3001702   .1163921    -2.58   0.011    -.5302145   -.0701259
 _Iisocode_3 |    -.18286   .0816519    -2.24   0.027    -.3442417   -.0214782
 _Iisocode_4 |  -.8137232   .1161032    -7.01   0.000    -1.043196     -.58425
 _Iisocode_5 |  -.3453417   .1058305    -3.26   0.001    -.5545114    -.136172
 _Iisocode_6 |  -.5307305   .1114899    -4.76   0.000    -.7510859   -.3103752
 _Iisocode_7 |   .0620795   .1107438     0.56   0.576    -.1568011      .28096
 _Iisocode_8 |    .268052   .1543608     1.74   0.085    -.0370359    .5731399
 _Iisocode_9 |  -.2526991   .1058853    -2.39   0.018     -.461977   -.0434212
_Iisocode_10 |  -.3869701   .1104577    -3.50   0.001    -.6052851    -.168655
_Iisocode_11 |  -1.031442   .0866127   -11.91   0.000    -1.202628   -.8602551
_Iisocode_12 |  -.0151193   .1008891    -0.15   0.881    -.2145224    .1842839
_Iisocode_13 |   .2839311   .1126276     2.52   0.013     .0613272     .506535
_Iisocode_14 |   .0046093   .1129329     0.04   0.967    -.2185979    .2278166
_Iisocode_15 |  -.7599906   .1305106    -5.82   0.000    -1.017939   -.5020417
_Iisocode_16 |  -.9133132   .1169388    -7.81   0.000    -1.144438   -.6821884
_Iisocode_17 |   -1.10561   .1054087   -10.49   0.000    -1.313946   -.8972736
         age |   .0061284   .0030485     2.01   0.046     .0001033    .0121536
        age2 |  -.0000281   .0000346    -0.81   0.417    -.0000965    .0000402
        male |  -.0330958   .0180554    -1.83   0.069    -.0687817    .0025901
       _cons |   1.990717   .1232325    16.15   0.000     1.747153    2.234281
------------------------------------------------------------------------------
(5917 missing values generated)
(5917 missing values generated)
(5917 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_5 |     15905    2.644989           0   2.644989   2.644989
     diff2_5 |     15905    2.568573           0   2.568573   2.568573

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
intra_grou~t |     20619    1.678452    1.003731          0          3
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19952
                                                       F( 77,   184) =  203.84
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1444
                                                       Root MSE      =  .92761

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
intra_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1439734   .0314622    -4.58   0.000    -.2060464   -.0819004
         age |   .0091578   .0024819     3.69   0.000     .0042612    .0140543
        age2 |  -.0000768   .0000273    -2.81   0.005    -.0001306   -.0000229
        male |   .0441477   .0152925     2.89   0.004     .0139766    .0743188
   urban_dum |  -.1159266   .0255826    -4.53   0.000    -.1663996   -.0654536
_Ieducatio~1 |    .049148   .0367767     1.34   0.183    -.0234103    .1217063
_Ieducatio~2 |  -.0630593   .0217959    -2.89   0.004    -.1060614   -.0200572
_Ieducatio~3 |  -.1120592   .0310354    -3.61   0.000    -.1732903   -.0508281
_Ieducatio~4 |  -.2057492   .0298069    -6.90   0.000    -.2645564    -.146942
_Ieducatio~5 |   -.220374   .0356434    -6.18   0.000    -.2906964   -.1500517
_Ieducatio~6 |  -.2264568   .0443601    -5.10   0.000    -.3139767    -.138937
_Ieducatio~7 |  -.3512524   .0520549    -6.75   0.000    -.4539537   -.2485511
_Ieducatio~8 |  -.3028489   .0686166    -4.41   0.000    -.4382253   -.1674724
_Ieducatio~9 |  -.2778127    .087138    -3.19   0.002    -.4497307   -.1058947
_Ioccupat~_1 |  -.0024786   .0417238    -0.06   0.953    -.0847971    .0798398
_Ioccupat~_2 |  -.0150876   .0474588    -0.32   0.751    -.1087209    .0785457
_Ioccupat~_3 |  -.0886913   .0876346    -1.01   0.313     -.261589    .0842065
_Ioccupat~_4 |  -.0148552   .0729219    -0.20   0.839    -.1587258    .1290153
_Ioccupat~_5 |  -.0801196   .1165269    -0.69   0.493    -.3100202    .1497809
_Ioccupat~_6 |  -.1295714   .0422593    -3.07   0.002    -.2129466   -.0461962
_Ioccupati~7 |  -.0541502   .0838972    -0.65   0.519    -.2196744     .111374
_Ioccupat~_8 |  -.1235459    .065714    -1.88   0.062    -.2531957    .0061038
_Ioccupat~_9 |  -.0879967   .0668414    -1.32   0.190    -.2198709    .0438774
_Ioccupat~10 |  -.0020517   .0509348    -0.04   0.968     -.102543    .0984397
_Ioccupat~11 |  -.0917547   .0452368    -2.03   0.044    -.1810041   -.0025052
_Ioccupat~12 |  -.1581744   .0666414    -2.37   0.019    -.2896539   -.0266949
_Ioccupat~13 |  -.0689632   .0713807    -0.97   0.335    -.2097932    .0718667
_Ioccupat~14 |  -.1215158   .0489206    -2.48   0.014    -.2180331   -.0249984
_Ioccupat~15 |  -.2328115   .0595958    -3.91   0.000    -.3503905   -.1152324
_Ioccupat~16 |  -.0582813    .054866    -1.06   0.290    -.1665287    .0499662
_Ioccupat~18 |  -.1743113   .0583662    -2.99   0.003    -.2894643   -.0591584
_Ioccupat~19 |  -.1117831   .0905454    -1.23   0.219    -.2904238    .0668575
_Ioccupat~20 |   .0108032   .0550901     0.20   0.845    -.0978863    .1194927
_Ioccupat~21 |  -.0109375   .0633017    -0.17   0.863     -.135828     .113953
_Ioccupat~22 |  -.0959128     .06767    -1.42   0.158    -.2294217    .0375962
_Ioccupat~23 |  -.1228717    .038442    -3.20   0.002    -.1987155   -.0470279
_Ioccupat~24 |  -.0039536   .0383845    -0.10   0.918     -.079684    .0717767
_Ioccupat~25 |  -.0266633   .3088944    -0.09   0.931    -.6360935     .582767
_Ioccupa~995 |   .0334471   .0920616     0.36   0.717    -.1481849    .2150792
_Ireligion_2 |   .0308053   .0371299     0.83   0.408    -.0424497    .1040604
_Ireligion_3 |   .0290498    .038624     0.75   0.453    -.0471531    .1052527
_Ireligion_4 |    .010134   .0456706     0.22   0.825    -.0799714    .1002394
_Ireligion_5 |   .0493377    .052556     0.94   0.349    -.0543522    .1530276
_Ireligion_6 |   .0583148   .0570488     1.02   0.308    -.0542391    .1708686
_Ireligion_7 |   .0928018   .4238346     0.22   0.827    -.7433986    .9290023
_Ireligio~10 |   .0273953    .036482     0.75   0.454    -.0445815    .0993721
_Ireligio~11 |   .0966631   .0601905     1.61   0.110    -.0220892    .2154153
_Ireligio~12 |   .1526292   .0670177     2.28   0.024     .0204073    .2848511
_Ireligio~13 |  -.1093441   .0953757    -1.15   0.253    -.2975147    .0788265
_Ireligio~14 |  -.0355659   .0497595    -0.71   0.476    -.1337386    .0626067
_Ireligio~15 |   .3215963   .0815622     3.94   0.000      .160679    .4825136
_Ireligi~360 |    .329596   .1141821     2.89   0.004     .1043215    .5548705
_Ireligi~361 |   .2717309   .1032342     2.63   0.009     .0680559    .4754059
_Ireligi~362 |   .5442323   .3109535     1.75   0.082    -.0692605    1.157725
_Ireligi~363 |   .2592646   .1841035     1.41   0.161    -.1039608    .6224899
_Ireligi~995 |   .0405851   .0802264     0.51   0.614    -.1176969     .198867
_Iliving_c~2 |   .0355514   .0367881     0.97   0.335    -.0370292    .1081321
_Iliving_c~3 |    .062996   .0350994     1.79   0.074    -.0062529     .132245
_Iliving_c~4 |   .0926919   .0376858     2.46   0.015     .0183401    .1670436
_Iliving_c~5 |   .0836521   .0488249     1.71   0.088    -.0126766    .1799808
district_e~c |  -.0257052   .0795279    -0.32   0.747    -.1826089    .1311986
frac_ethni~t |   -.014761   .0596347    -0.25   0.805    -.1324166    .1028947
 _Iisocode_2 |  -.4019838    .120371    -3.34   0.001    -.6394686   -.1644989
 _Iisocode_3 |   .1603126   .1042858     1.54   0.126    -.0454371    .3660623
 _Iisocode_4 |  -.2099575   .1260982    -1.67   0.098    -.4587418    .0388268
 _Iisocode_5 |  -.2977755     .11828    -2.52   0.013     -.531135   -.0644161
 _Iisocode_6 |  -.2201523   .1057469    -2.08   0.039    -.4287847   -.0115199
 _Iisocode_7 |   .2557534   .1121836     2.28   0.024     .0344219    .4770849
 _Iisocode_8 |   .2204603   .1216962     1.81   0.072    -.0196391    .4605598
 _Iisocode_9 |   .4645251   .1084739     4.28   0.000     .2505125    .6785376
_Iisocode_10 |  -.2405913   .1229824    -1.96   0.052    -.4832282    .0020456
_Iisocode_11 |  -.2599595   .1072913    -2.42   0.016    -.4716389   -.0482802
_Iisocode_12 |   .4099423   .1323784     3.10   0.002     .1487677     .671117
_Iisocode_13 |   .3388179   .1249373     2.71   0.007     .0923241    .5853117
_Iisocode_14 |   .0391024   .1473321     0.27   0.791     -.251575    .3297799
_Iisocode_15 |  -.2088674   .1313859    -1.59   0.114    -.4680841    .0503492
_Iisocode_16 |  -.1028244   .1190141    -0.86   0.389    -.3376322    .1319833
_Iisocode_17 |  (omitted)
       _cons |   1.676684   .1518327    11.04   0.000     1.377127    1.976241
------------------------------------------------------------------------------
(1870 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19952
                                                       F( 16,   184) =   57.72
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1153
                                                       Root MSE      =  .94182

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
intra_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1788712   .0410566    -4.36   0.000    -.2598733    -.097869
 _Iisocode_2 |  -.5806294   .1353281    -4.29   0.000    -.8476236   -.3136351
 _Iisocode_3 |   .0685908   .1111503     0.62   0.538    -.1507022    .2878838
 _Iisocode_4 |  -.3338478   .1467429    -2.28   0.024    -.6233629   -.0443328
 _Iisocode_5 |  -.4169188   .1343725    -3.10   0.002    -.6820277   -.1518098
 _Iisocode_6 |  -.3047625   .1234306    -2.47   0.014    -.5482837   -.0612412
 _Iisocode_7 |   .3292733   .1254458     2.62   0.009     .0817763    .5767704
 _Iisocode_8 |   .1705445   .1540496     1.11   0.270    -.1333862    .4744752
 _Iisocode_9 |   .3891204   .1233954     3.15   0.002     .1456687    .6325721
_Iisocode_10 |  -.4199845   .1412213    -2.97   0.003    -.6986058   -.1413633
_Iisocode_11 |  -.3475957   .1343898    -2.59   0.010    -.6127388   -.0824526
_Iisocode_12 |    .628931   .1000267     6.29   0.000     .4315843    .8262777
_Iisocode_13 |   .2774809   .1423683     1.95   0.053    -.0034034    .5583651
_Iisocode_14 |  -.0954553   .1684224    -0.57   0.572    -.4277426     .236832
_Iisocode_15 |  -.3959307   .1496624    -2.65   0.009    -.6912057   -.1006557
_Iisocode_16 |  -.3138013   .1369964    -2.29   0.023    -.5840871   -.0435156
_Iisocode_17 |  (omitted)
       _cons |   1.883875   .1287265    14.63   0.000     1.629906    2.137845
------------------------------------------------------------------------------
(1870 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19952
                                                       F( 19,   184) =   78.28
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1211
                                                       Root MSE      =   .9388

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
intra_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1807979   .0407218    -4.44   0.000    -.2611396   -.1004562
 _Iisocode_2 |  -.5807651   .1343052    -4.32   0.000    -.8457412    -.315789
 _Iisocode_3 |   .0546241   .1093575     0.50   0.618    -.1611316    .2703799
 _Iisocode_4 |  -.3267094   .1452437    -2.25   0.026    -.6132664   -.0401523
 _Iisocode_5 |  -.4421083   .1330596    -3.32   0.001     -.704627   -.1795896
 _Iisocode_6 |   -.315599   .1223615    -2.58   0.011     -.557011    -.074187
 _Iisocode_7 |   .3031174   .1238383     2.45   0.015     .0587919    .5474429
 _Iisocode_8 |   .1803032   .1526754     1.18   0.239    -.1209162    .4815227
 _Iisocode_9 |   .4055555   .1220868     3.32   0.001     .1646855    .6464256
_Iisocode_10 |  -.4028582   .1392278    -2.89   0.004    -.6775464   -.1281701
_Iisocode_11 |  -.3121381   .1329028    -2.35   0.020    -.5743476   -.0499287
_Iisocode_12 |   .6245999   .0983572     6.35   0.000     .4305471    .8186528
_Iisocode_13 |   .2762843    .141524     1.95   0.052    -.0029341    .5555026
_Iisocode_14 |  -.0720888   .1651115    -0.44   0.663    -.3978439    .2536664
_Iisocode_15 |  -.4065313   .1478852    -2.75   0.007    -.6983001   -.1147625
_Iisocode_16 |  -.2964504   .1358018    -2.18   0.030    -.5643794   -.0285215
_Iisocode_17 |  (omitted)
         age |   .0118771   .0022241     5.34   0.000     .0074891    .0162651
        age2 |  -.0000776   .0000257    -3.01   0.003    -.0001284   -.0000268
        male |   .0090768   .0135123     0.67   0.503    -.0175821    .0357357
       _cons |   1.563205   .1415504    11.04   0.000     1.283934    1.842475
------------------------------------------------------------------------------
(1870 missing values generated)
(1870 missing values generated)
(1870 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_3 |     19952    4.125584           0   4.125584   4.125584
     diff2_3 |     19952    3.909726           0   3.909726   3.909726
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
i.v30             _Iv30_1-8           (naturally coded; _Iv30_1 omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16636
                                                       F( 91,   146) = 1043.74
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1554
                                                       Root MSE      =   .9092

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
intra_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1876719   .0317161    -5.92   0.000    -.2503539   -.1249899
         age |   .0074431   .0022936     3.25   0.001     .0029102     .011976
        age2 |  -.0000584   .0000245    -2.38   0.019    -.0001069   -9.89e-06
        male |   .0398453    .015935     2.50   0.014     .0083523    .0713383
   urban_dum |  -.1056781   .0270449    -3.91   0.000     -.159128   -.0522281
_Ieducatio~1 |   .0588386   .0377174     1.56   0.121     -.015704    .1333812
_Ieducatio~2 |  -.0566171   .0244614    -2.31   0.022    -.1049613   -.0082729
_Ieducatio~3 |  -.1108207   .0355902    -3.11   0.002    -.1811592   -.0404821
_Ieducatio~4 |  -.2064205   .0345437    -5.98   0.000    -.2746908   -.1381502
_Ieducatio~5 |   -.196707   .0381313    -5.16   0.000    -.2720677   -.1213464
_Ieducatio~6 |  -.2158899   .0483513    -4.47   0.000    -.3114488    -.120331
_Ieducatio~7 |  -.3430205   .0593385    -5.78   0.000    -.4602939   -.2257471
_Ieducatio~8 |  -.3009774   .0795072    -3.79   0.000    -.4581111   -.1438437
_Ieducatio~9 |  -.2875078   .0951214    -3.02   0.003    -.4755004   -.0995151
_Ioccupat~_1 |   .0138898   .0453594     0.31   0.760    -.0757559    .1035356
_Ioccupat~_2 |  -.0053313   .0474879    -0.11   0.911    -.0991839    .0885212
_Ioccupat~_3 |  -.0659124   .0913794    -0.72   0.472    -.2465096    .1146848
_Ioccupat~_4 |  -.0021636   .0694516    -0.03   0.975    -.1394239    .1350967
_Ioccupat~_5 |  -.0311751   .1303513    -0.24   0.811    -.2887943    .2264442
_Ioccupat~_6 |  -.1117818   .0429755    -2.60   0.010    -.1967162   -.0268473
_Ioccupati~7 |  -.0113612   .0905571    -0.13   0.900    -.1903334     .167611
_Ioccupat~_8 |  -.0991816   .0719342    -1.38   0.170    -.2413485    .0429853
_Ioccupat~_9 |  -.0780281   .0789891    -0.99   0.325    -.2341379    .0780817
_Ioccupat~10 |   .0136381   .0561632     0.24   0.808    -.0973598    .1246361
_Ioccupat~11 |  -.0797025   .0483034    -1.65   0.101    -.1751667    .0157618
_Ioccupat~12 |  -.1221915   .0760056    -1.61   0.110    -.2724049    .0280218
_Ioccupat~13 |  -.0951201    .079895    -1.19   0.236    -.2530203    .0627801
_Ioccupat~14 |  -.1078428   .0480069    -2.25   0.026     -.202721   -.0129646
_Ioccupat~15 |  -.2394748   .0603309    -3.97   0.000    -.3587095   -.1202401
_Ioccupat~16 |  -.0590868   .0599128    -0.99   0.326    -.1774951    .0593215
_Ioccupat~18 |  -.1552958    .062681    -2.48   0.014     -.279175   -.0314165
_Ioccupat~19 |  -.0293261   .0950591    -0.31   0.758    -.2171956    .1585435
_Ioccupat~20 |   .0083499   .0591136     0.14   0.888    -.1084791    .1251789
_Ioccupat~21 |   .0125729   .0652794     0.19   0.848    -.1164418    .1415876
_Ioccupat~22 |  -.0472742   .0664219    -0.71   0.478    -.1785467    .0839984
_Ioccupat~23 |  -.1084924   .0391423    -2.77   0.006    -.1858511   -.0311337
_Ioccupat~24 |   .0089132   .0425283     0.21   0.834    -.0751375    .0929639
_Ioccupat~25 |   .0177352   .3534231     0.05   0.960    -.6807509    .7162214
_Ioccupa~995 |   .0333583   .0969099     0.34   0.731    -.1581692    .2248857
_Ireligion_2 |   .0252715   .0411359     0.61   0.540    -.0560272    .1065703
_Ireligion_3 |    .016665   .0457353     0.36   0.716    -.0737236    .1070537
_Ireligion_4 |   .0075448   .0523064     0.14   0.886    -.0958308    .1109203
_Ireligion_5 |   .0565784   .0634768     0.89   0.374    -.0688737    .1820306
_Ireligion_6 |     .10121   .0546722     1.85   0.066    -.0068411    .2092611
_Ireligion_7 |   .0596404   .4884053     0.12   0.903    -.9056173    1.024898
_Ireligio~10 |   .0364995   .0424524     0.86   0.391    -.0474011    .1204001
_Ireligio~11 |   .0294716   .0557433     0.53   0.598    -.0806964    .1396396
_Ireligio~12 |     .08291   .0673528     1.23   0.220    -.0502024    .2160223
_Ireligio~13 |   -.116985   .1108283    -1.06   0.293    -.3360201    .1020501
_Ireligio~14 |  -.0866482   .0592371    -1.46   0.146    -.2037213    .0304248
_Ireligio~15 |   .2230063   .0735966     3.03   0.003     .0775539    .3684587
_Ireligi~360 |   .3361643   .1269273     2.65   0.009     .0853122    .5870164
_Ireligi~361 |   .2320103   .1352252     1.72   0.088    -.0352415     .499262
_Ireligi~362 |   .3403983   .5034218     0.68   0.500    -.6545372    1.335334
_Ireligi~363 |   .3162739   .2270826     1.39   0.166    -.1325198    .7650675
_Ireligi~995 |   .0211636   .0883497     0.24   0.811     -.153446    .1957732
_Iliving_c~2 |   .0151925    .040285     0.38   0.707    -.0644246    .0948096
_Iliving_c~3 |   .0396851   .0390154     1.02   0.311    -.0374227     .116793
_Iliving_c~4 |    .062679   .0412795     1.52   0.131    -.0189035    .1442615
_Iliving_c~5 |   .0517122   .0548409     0.94   0.347    -.0566724    .1600968
district_e~c |   .0188347   .0823874     0.23   0.819    -.1439913    .1816607
frac_ethni~t |   .0305519    .059116     0.52   0.606    -.0862816    .1473855
 _Iisocode_2 |  -.4360913   .1518006    -2.87   0.005    -.7361018   -.1360808
 _Iisocode_3 |   .1362267   .1026245     1.33   0.186    -.0665948    .3390482
 _Iisocode_4 |  -.3058086    .154913    -1.97   0.050    -.6119702     .000353
 _Iisocode_5 |  -.3451712   .1800061    -1.92   0.057    -.7009254     .010583
 _Iisocode_6 |  -.2000214   .1138855    -1.76   0.081    -.4250984    .0250557
 _Iisocode_7 |   .1962205   .0997971     1.97   0.051    -.0010131    .3934541
 _Iisocode_8 |   .2756303   .1407419     1.96   0.052    -.0025243     .553785
 _Iisocode_9 |   .5026414   .1171068     4.29   0.000     .2711979     .734085
_Iisocode_10 |  -.2010321   .1520051    -1.32   0.188    -.5014467    .0993824
_Iisocode_11 |  -.3508095   .1002955    -3.50   0.001    -.5490281   -.1525908
_Iisocode_12 |   .2813985   .1595224     1.76   0.080    -.0338728    .5966698
_Iisocode_13 |   .3413191   .1373162     2.49   0.014     .0699349    .6127033
_Iisocode_14 |   .0209911   .1522754     0.14   0.891    -.2799577      .32194
_Iisocode_15 |  -.2937773   .1905623    -1.54   0.125    -.6703943    .0828396
_Iisocode_16 |  -.1332274   .1358908    -0.98   0.329    -.4017946    .1353399
_Iisocode_17 |  (omitted)
malaria_ec~y |   .0009701   .0042552     0.23   0.820    -.0074397    .0093799
total_miss~a |  -91.90526   58.86153    -1.56   0.121     -208.236    24.42546
explorer_c~t |  -.0203079   .0565978    -0.36   0.720    -.1321647    .0915488
railway_co~t |   .0642806   .0633567     1.01   0.312    -.0609342    .1894953
cities_140~m |   .1204532   .0741499     1.62   0.106    -.0260926    .2669991
     _Iv30_2 |   .1051668   .2609381     0.40   0.688    -.4105371    .6208708
     _Iv30_3 |   .1855974   .1616164     1.15   0.253    -.1338125    .5050073
     _Iv30_4 |   .0506481   .1582815     0.32   0.749    -.2621708     .363467
     _Iv30_5 |   .0947968   .1447675     0.65   0.514    -.1913139    .3809074
     _Iv30_6 |   .1123913   .1401132     0.80   0.424    -.1645207    .3893033
     _Iv30_7 |   .1053997   .1496946     0.70   0.482    -.1904485    .4012479
     _Iv30_8 |   .3784584   .1942928     1.95   0.053    -.0055313     .762448
         v33 |  -.0358928   .0254962    -1.41   0.161    -.0862822    .0144965
ln_init_po~y |    .023538    .024975     0.94   0.348    -.0258212    .0728973
       _cons |   1.669569   .1985905     8.41   0.000     1.277086    2.062053
------------------------------------------------------------------------------
(5186 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16636
                                                       F( 16,   146) =  183.71
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1209
                                                       Root MSE      =  .92545

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
intra_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.2080195   .0411459    -5.06   0.000     -.289338   -.1267011
 _Iisocode_2 |  -.6071172   .1297187    -4.68   0.000    -.8634863   -.3507482
 _Iisocode_3 |    .096913   .0997771     0.97   0.333     -.100281     .294107
 _Iisocode_4 |  -.4283062   .1407155    -3.04   0.003    -.7064086   -.1502038
 _Iisocode_5 |  -.4494583   .1217348    -3.69   0.000    -.6900484   -.2088682
 _Iisocode_6 |  -.3384965   .1154281    -2.93   0.004    -.5666223   -.1103707
 _Iisocode_7 |   .2791047   .1200674     2.32   0.021     .0418101    .5163994
 _Iisocode_8 |   .1905418   .1510116     1.26   0.209    -.1079092    .4889929
 _Iisocode_9 |   .3699296   .1069459     3.46   0.001     .1585675    .5812916
_Iisocode_10 |  -.4545339   .1346671    -3.38   0.001    -.7206826   -.1883852
_Iisocode_11 |  -.3840802   .1215254    -3.16   0.002    -.6242563    -.143904
_Iisocode_12 |   .5960861   .0900401     6.62   0.000     .4181356    .7740365
_Iisocode_13 |   .2112232   .1360175     1.55   0.123    -.0575943    .4800407
_Iisocode_14 |  -.1661242   .1661461    -1.00   0.319    -.4944864     .162238
_Iisocode_15 |  -.4522655   .1469452    -3.08   0.002      -.74268   -.1618511
_Iisocode_16 |  -.4107727   .1288008    -3.19   0.002    -.6653276   -.1562178
_Iisocode_17 |  (omitted)
       _cons |   1.955891   .1217324    16.07   0.000     1.715306    2.196476
------------------------------------------------------------------------------
(5186 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16636
                                                       F( 19,   146) =  175.57
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1268
                                                       Root MSE      =  .92245

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
intra_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.2098961   .0407515    -5.15   0.000    -.2904352   -.1293571
 _Iisocode_2 |  -.6048213    .127336    -4.75   0.000    -.8564812   -.3531614
 _Iisocode_3 |    .082313   .0985809     0.83   0.405     -.112517    .2771429
 _Iisocode_4 |   -.422011   .1391791    -3.03   0.003     -.697077   -.1469451
 _Iisocode_5 |  -.4763028   .1206209    -3.95   0.000    -.7146915   -.2379141
 _Iisocode_6 |  -.3462116   .1141831    -3.03   0.003    -.5718769   -.1205464
 _Iisocode_7 |   .2512739   .1188369     2.11   0.036      .016411    .4861368
 _Iisocode_8 |   .2059766   .1494686     1.38   0.170     -.089425    .5013782
 _Iisocode_9 |   .3859716   .1060241     3.64   0.000     .1764313    .5955119
_Iisocode_10 |  -.4392259   .1333091    -3.29   0.001    -.7026907    -.175761
_Iisocode_11 |  -.3488977   .1201785    -2.90   0.004     -.586412   -.1113833
_Iisocode_12 |    .590321   .0888682     6.64   0.000     .4146868    .7659552
_Iisocode_13 |    .211083   .1355021     1.56   0.121     -.056716     .478882
_Iisocode_14 |   -.141762   .1630094    -0.87   0.386    -.4639248    .1804009
_Iisocode_15 |  -.4628216   .1453601    -3.18   0.002    -.7501035   -.1755397
_Iisocode_16 |  -.3924591   .1279496    -3.07   0.003    -.6453317   -.1395864
_Iisocode_17 |  (omitted)
         age |   .0103983   .0019877     5.23   0.000     .0064698    .0143267
        age2 |  -.0000598   .0000223    -2.68   0.008    -.0001038   -.0000157
        male |    .004931   .0143026     0.34   0.731    -.0233358    .0331978
       _cons |   1.663693   .1342712    12.39   0.000     1.398326    1.929059
------------------------------------------------------------------------------
(5186 missing values generated)
(5186 missing values generated)
(5186 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_5 |     16636    9.223276           0   9.223276   9.223276
     diff2_5 |     16636    8.444477           0   8.444477   8.444477

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
inter_grou~t |     20417    1.363423    .9980242          0          3
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19765
                                                       F( 77,   184) =  259.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1120
                                                       Root MSE      =  .93819

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.0968873   .0278014    -3.48   0.001    -.1517378   -.0420368
         age |   .0169921   .0023807     7.14   0.000     .0122951     .021689
        age2 |  -.0001391   .0000247    -5.64   0.000    -.0001878   -.0000905
        male |    .055959   .0156772     3.57   0.000     .0250289    .0868891
   urban_dum |  -.0888447   .0295518    -3.01   0.003    -.1471486   -.0305409
_Ieducatio~1 |   .0887528    .037475     2.37   0.019     .0148168    .1626888
_Ieducatio~2 |  -.0415341   .0283115    -1.47   0.144     -.097391    .0143228
_Ieducatio~3 |   -.074948   .0303321    -2.47   0.014    -.1347915   -.0151045
_Ieducatio~4 |  -.1106168   .0345879    -3.20   0.002    -.1788567   -.0423768
_Ieducatio~5 |  -.1247129   .0343312    -3.63   0.000    -.1924464   -.0569794
_Ieducatio~6 |  -.1185491   .0439804    -2.70   0.008    -.2053198   -.0317783
_Ieducatio~7 |  -.1896817    .051704    -3.67   0.000    -.2916906   -.0876728
_Ieducatio~8 |  -.1168875    .063649    -1.84   0.068    -.2424632    .0086882
_Ieducatio~9 |  -.1884646   .0888532    -2.12   0.035    -.3637667   -.0131625
_Ioccupat~_1 |  -.0448366   .0390463    -1.15   0.252    -.1218726    .0321994
_Ioccupat~_2 |  -.0631881   .0448063    -1.41   0.160    -.1515883    .0252121
_Ioccupat~_3 |  -.1086783    .083475    -1.30   0.195    -.2733695    .0560129
_Ioccupat~_4 |  -.0655504   .0541088    -1.21   0.227    -.1723038     .041203
_Ioccupat~_5 |  -.0394729    .098615    -0.40   0.689    -.2340345    .1550887
_Ioccupat~_6 |  -.0935028   .0389511    -2.40   0.017    -.1703511   -.0166545
_Ioccupati~7 |  -.0636843   .0497856    -1.28   0.202    -.1619083    .0345398
_Ioccupat~_8 |  -.1296234    .059335    -2.18   0.030    -.2466877    -.012559
_Ioccupat~_9 |   -.135538   .0698161    -1.94   0.054    -.2732809    .0022049
_Ioccupat~10 |   .0250446   .0566777     0.44   0.659    -.0867772    .1368664
_Ioccupat~11 |  -.1105945   .0471578    -2.35   0.020    -.2036342   -.0175549
_Ioccupat~12 |  -.1092018   .0613958    -1.78   0.077     -.230332    .0119284
_Ioccupat~13 |  -.0591192   .0593835    -1.00   0.321    -.1762792    .0580408
_Ioccupat~14 |  -.1356656   .0444016    -3.06   0.003    -.2232673    -.048064
_Ioccupat~15 |   -.234003   .0590888    -3.96   0.000    -.3505817   -.1174243
_Ioccupat~16 |   .0185269   .0494183     0.37   0.708    -.0789725    .1160262
_Ioccupat~18 |  -.1046795   .0512467    -2.04   0.043    -.2057861   -.0035728
_Ioccupat~19 |  -.0808538   .0838148    -0.96   0.336    -.2462154    .0845077
_Ioccupat~20 |   -.009173   .0513914    -0.18   0.859    -.1105653    .0922192
_Ioccupat~21 |  -.0525163   .0628627    -0.84   0.405    -.1765407    .0715082
_Ioccupat~22 |  -.1364708    .068454    -1.99   0.048    -.2715264   -.0014152
_Ioccupat~23 |  -.1108518   .0347443    -3.19   0.002    -.1794002   -.0423033
_Ioccupat~24 |  -.0341987   .0394667    -0.87   0.387    -.1120642    .0436668
_Ioccupat~25 |    .108847   .2415945     0.45   0.653    -.3678047    .5854986
_Ioccupa~995 |   .0581702   .1006469     0.58   0.564    -.1404003    .2567406
_Ireligion_2 |   .0395055   .0379482     1.04   0.299    -.0353641    .1143751
_Ireligion_3 |   .0444544   .0422769     1.05   0.294    -.0389555    .1278643
_Ireligion_4 |  -.0020168   .0444537    -0.05   0.964    -.0897213    .0856877
_Ireligion_5 |   .0431006   .0557713     0.77   0.441    -.0669328     .153134
_Ireligion_6 |  -.0504245    .047315    -1.07   0.288    -.1437742    .0429252
_Ireligion_7 |   .1355961   .4000736     0.34   0.735    -.6537252    .9249174
_Ireligio~10 |   .0257529   .0423309     0.61   0.544    -.0577635    .1092692
_Ireligio~11 |    .087371   .0624377     1.40   0.163    -.0358149    .2105569
_Ireligio~12 |   .1604942   .0694965     2.31   0.022     .0233816    .2976067
_Ireligio~13 |   .0590131   .0802914     0.73   0.463     -.099397    .2174232
_Ireligio~14 |  -.0261486   .0537333    -0.49   0.627    -.1321612    .0798639
_Ireligio~15 |   .1940855   .1038911     1.87   0.063    -.0108856    .3990565
_Ireligi~360 |   .2263173   .1510363     1.50   0.136    -.0716682    .5243029
_Ireligi~361 |   .3203919   .1225595     2.61   0.010     .0785893    .5621945
_Ireligi~362 |  -.0409225   .3773401    -0.11   0.914    -.7853921    .7035471
_Ireligi~363 |   .3486168   .2028487     1.72   0.087    -.0515917    .7488253
_Ireligi~995 |   .0664996   .1061862     0.63   0.532    -.1429994    .2759987
_Iliving_c~2 |   .0637525   .0349759     1.82   0.070    -.0052529    .1327579
_Iliving_c~3 |   .1250129   .0329376     3.80   0.000     .0600289    .1899968
_Iliving_c~4 |   .1279361   .0331405     3.86   0.000     .0625518    .1933203
_Iliving_c~5 |   .1748808   .0575123     3.04   0.003     .0614125     .288349
district_e~c |   .1085789    .075806     1.43   0.154    -.0409818    .2581397
frac_ethni~t |  -.0050946   .0541411    -0.09   0.925    -.1119119    .1017227
 _Iisocode_2 |  -.3024934   .1069914    -2.83   0.005     -.513581   -.0914058
 _Iisocode_3 |    .093653   .0800391     1.17   0.243    -.0642593    .2515653
 _Iisocode_4 |  -.3291861    .109467    -3.01   0.003    -.5451579   -.1132142
 _Iisocode_5 |  -.3137303    .106259    -2.95   0.004     -.523373   -.1040876
 _Iisocode_6 |  -.2397669   .0992214    -2.42   0.017    -.4355248   -.0440091
 _Iisocode_7 |   .0493254    .102128     0.48   0.630    -.1521671    .2508179
 _Iisocode_8 |   .2360626     .11745     2.01   0.046     .0043407    .4677844
 _Iisocode_9 |   .3128458    .103771     3.01   0.003     .1081118    .5175798
_Iisocode_10 |  -.1150231   .1179531    -0.98   0.331    -.3477375    .1176914
_Iisocode_11 |  -.2925708   .0815545    -3.59   0.000     -.453473   -.1316686
_Iisocode_12 |   .4503831   .1399227     3.22   0.002      .174324    .7264423
_Iisocode_13 |   .3446372   .1116571     3.09   0.002     .1243444      .56493
_Iisocode_14 |  -.1135616   .1266252    -0.90   0.371    -.3633856    .1362624
_Iisocode_15 |  -.3043857   .1262442    -2.41   0.017     -.553458   -.0553135
_Iisocode_16 |  -.1724563    .110972    -1.55   0.122    -.3913974    .0464848
_Iisocode_17 |  (omitted)
       _cons |   1.045463   .1450459     7.21   0.000     .7592964     1.33163
------------------------------------------------------------------------------
(2057 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19765
                                                       F( 16,   184) =   41.78
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0909
                                                       Root MSE      =  .94782

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.126069   .0321557    -3.92   0.000    -.1895103   -.0626276
 _Iisocode_2 |   -.353687   .1077289    -3.28   0.001    -.5662297   -.1411443
 _Iisocode_3 |   .0565029   .0829917     0.68   0.497    -.1072349    .2202406
 _Iisocode_4 |  -.3728323   .1135929    -3.28   0.001    -.5969443   -.1487202
 _Iisocode_5 |  -.3071107   .1081384    -2.84   0.005    -.5204612   -.0937601
 _Iisocode_6 |  -.2411553   .1023506    -2.36   0.020    -.4430869   -.0392236
 _Iisocode_7 |   .1662128   .1116974     1.49   0.138    -.0541595    .3865852
 _Iisocode_8 |    .228386   .1309283     1.74   0.083    -.0299277    .4866998
 _Iisocode_9 |   .2697299   .1148857     2.35   0.020     .0430672    .4963926
_Iisocode_10 |  -.1858343   .1226077    -1.52   0.131     -.427732    .0560635
_Iisocode_11 |  -.3306702   .1048423    -3.15   0.002    -.5375179   -.1238225
_Iisocode_12 |   .7301787   .0874377     8.35   0.000     .5576693     .902688
_Iisocode_13 |   .3337157    .114452     2.92   0.004     .1079088    .5595226
_Iisocode_14 |  -.1721986   .1312596    -1.31   0.191    -.4311659    .0867687
_Iisocode_15 |   -.363591   .1285414    -2.83   0.005    -.6171954   -.1099865
_Iisocode_16 |  -.2547337   .1152747    -2.21   0.028    -.4821638   -.0273037
_Iisocode_17 |  (omitted)
       _cons |   1.516352   .1032826    14.68   0.000     1.312582    1.720123
------------------------------------------------------------------------------
(2057 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19765
                                                       F( 19,   184) =   57.33
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1001
                                                       Root MSE      =  .94307

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1279156   .0319104    -4.01   0.000    -.1908729   -.0649582
 _Iisocode_2 |  -.3495685   .1079101    -3.24   0.001    -.5624686   -.1366683
 _Iisocode_3 |   .0421196   .0818777     0.51   0.608    -.1194203    .2036594
 _Iisocode_4 |  -.3627747   .1138877    -3.19   0.002    -.5874683    -.138081
 _Iisocode_5 |  -.3315775   .1076296    -3.08   0.002    -.5439242   -.1192307
 _Iisocode_6 |   -.254408    .102438    -2.48   0.014    -.4565121    -.052304
 _Iisocode_7 |   .1375107   .1113215     1.24   0.218    -.0821199    .3571414
 _Iisocode_8 |   .2404795   .1308561     1.84   0.068    -.0176917    .4986508
 _Iisocode_9 |   .2907649   .1144022     2.54   0.012     .0650563    .5164736
_Iisocode_10 |  -.1632501   .1215925    -1.34   0.181    -.4031448    .0766447
_Iisocode_11 |  -.2865388   .1046419    -2.74   0.007     -.492991   -.0800866
_Iisocode_12 |   .7254188   .0862819     8.41   0.000     .5551897     .895648
_Iisocode_13 |    .331388   .1146966     2.89   0.004     .1050985    .5576775
_Iisocode_14 |  -.1430964   .1284987    -1.11   0.267    -.3966167    .1104239
_Iisocode_15 |  -.3749838   .1274959    -2.94   0.004    -.6265258   -.1234419
_Iisocode_16 |  -.2342595   .1160003    -2.02   0.045    -.4631211   -.0053979
_Iisocode_17 |  (omitted)
         age |    .017648   .0022779     7.75   0.000     .0131538    .0221423
        age2 |  -.0001344   .0000249    -5.40   0.000    -.0001834   -.0000853
        male |   .0358842   .0156585     2.29   0.023     .0049909    .0667775
       _cons |   1.057326   .1220509     8.66   0.000      .816527    1.298125
------------------------------------------------------------------------------
(2057 missing values generated)
(2057 missing values generated)
(2057 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_3 |     19765    3.320147           0   3.320147   3.320147
     diff2_3 |     19765    3.122555           0   3.122555   3.122555
i.education       _Ieducation_0-9     (naturally coded; _Ieducation_0 omitted)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.living_cond~s   _Iliving_co_1-5     (naturally coded; _Iliving_co_1 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
i.v30             _Iv30_1-8           (naturally coded; _Iv30_1 omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16473
                                                       F( 91,   146) =  231.42
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1185
                                                       Root MSE      =  .91944

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1151439   .0299127    -3.85   0.000    -.1742618    -.056026
         age |   .0166278   .0025709     6.47   0.000     .0115467    .0217088
        age2 |  -.0001353   .0000263    -5.15   0.000    -.0001873   -.0000834
        male |   .0480201   .0163802     2.93   0.004     .0156472    .0803931
   urban_dum |  -.0823633   .0316908    -2.60   0.010    -.1449953   -.0197313
_Ieducatio~1 |   .0767359   .0436767     1.76   0.081    -.0095843    .1630562
_Ieducatio~2 |  -.0391075   .0324074    -1.21   0.229    -.1031557    .0249407
_Ieducatio~3 |  -.0726459   .0340059    -2.14   0.034    -.1398533   -.0054385
_Ieducatio~4 |  -.1154366   .0393687    -2.93   0.004    -.1932428   -.0376304
_Ieducatio~5 |  -.1110168   .0372369    -2.98   0.003    -.1846098   -.0374238
_Ieducatio~6 |  -.1071504   .0455957    -2.35   0.020    -.1972633   -.0170374
_Ieducatio~7 |  -.2028726   .0580651    -3.49   0.001    -.3176292   -.0881159
_Ieducatio~8 |  -.1139998   .0691124    -1.65   0.101    -.2505898    .0225903
_Ieducatio~9 |  -.2383496   .0928138    -2.57   0.011    -.4217819   -.0549174
_Ioccupat~_1 |  -.0466103   .0374587    -1.24   0.215    -.1206416     .027421
_Ioccupat~_2 |    -.07201   .0457854    -1.57   0.118    -.1624977    .0184777
_Ioccupat~_3 |  -.0951813   .0864805    -1.10   0.273    -.2660968    .0757341
_Ioccupat~_4 |  -.0608104   .0519813    -1.17   0.244    -.1635434    .0419227
_Ioccupat~_5 |  -.0146234     .11067    -0.13   0.895    -.2333456    .2040989
_Ioccupat~_6 |  -.0836952   .0409551    -2.04   0.043    -.1646365   -.0027538
_Ioccupati~7 |  -.1168745   .0542736    -2.15   0.033    -.2241378   -.0096112
_Ioccupat~_8 |  -.1829629   .0625158    -2.93   0.004    -.3065157     -.05941
_Ioccupat~_9 |  -.1817087   .0830469    -2.19   0.030    -.3458381   -.0175793
_Ioccupat~10 |   .0307353   .0639753     0.48   0.632    -.0957021    .1571727
_Ioccupat~11 |  -.1282334   .0510601    -2.51   0.013    -.2291458    -.027321
_Ioccupat~12 |  -.0831463   .0707751    -1.17   0.242    -.2230224    .0567297
_Ioccupat~13 |   -.091135    .062799    -1.45   0.149    -.2152475    .0329774
_Ioccupat~14 |  -.1402712    .043231    -3.24   0.001    -.2257106   -.0548319
_Ioccupat~15 |  -.2504761    .060636    -4.13   0.000    -.3703138   -.1306385
_Ioccupat~16 |  -.0142676   .0512791    -0.28   0.781    -.1156128    .0870776
_Ioccupat~18 |  -.0961294   .0548444    -1.75   0.082     -.204521    .0122621
_Ioccupat~19 |  -.0304084   .0888294    -0.34   0.733     -.205966    .1451492
_Ioccupat~20 |  -.0076026   .0524352    -0.14   0.885    -.1112327    .0960276
_Ioccupat~21 |  -.0415868   .0679901    -0.61   0.542    -.1759587    .0927851
_Ioccupat~22 |  -.1162269   .0693948    -1.67   0.096     -.253375    .0209211
_Ioccupat~23 |  -.0975019    .036172    -2.70   0.008    -.1689903   -.0260134
_Ioccupat~24 |  -.0408986   .0411548    -0.99   0.322    -.1222348    .0404375
_Ioccupat~25 |   .2959731   .2527075     1.17   0.243    -.2034643    .7954104
_Ioccupa~995 |   .0603096    .102563     0.59   0.557    -.1423902    .2630095
_Ireligion_2 |   .0223234   .0402899     0.55   0.580    -.0573034    .1019502
_Ireligion_3 |   .0308553   .0486059     0.63   0.527    -.0652067    .1269174
_Ireligion_4 |  -.0134372    .046214    -0.29   0.772     -.104772    .0778975
_Ireligion_5 |   .1185384    .055455     2.14   0.034     .0089403    .2281366
_Ireligion_6 |  -.0255147   .0472816    -0.54   0.590    -.1189594      .06793
_Ireligion_7 |   .1144296   .4563088     0.25   0.802    -.7873943    1.016254
_Ireligio~10 |   .0196087   .0489869     0.40   0.690    -.0772063    .1164237
_Ireligio~11 |   .0453118   .0643759     0.70   0.483    -.0819172    .1725409
_Ireligio~12 |   .1260517   .0790915     1.59   0.113    -.0302605    .2823638
_Ireligio~13 |   .0225363   .0894752     0.25   0.801    -.1542975    .1993701
_Ireligio~14 |  -.0888205   .0632721    -1.40   0.163     -.213868    .0362271
_Ireligio~15 |   .1819579   .0909413     2.00   0.047     .0022265    .3616892
_Ireligi~360 |   .3436266   .1376315     2.50   0.014     .0716192    .6156341
_Ireligi~361 |   .3738544   .1474231     2.54   0.012     .0824954    .6652133
_Ireligi~362 |  -.5082021   .2023018    -2.51   0.013    -.9080204   -.1083839
_Ireligi~363 |   .4737394    .236076     2.01   0.047     .0071716    .9403072
_Ireligi~995 |  -.0037308   .1177311    -0.03   0.975    -.2364081    .2289465
_Iliving_c~2 |   .0564756   .0387457     1.46   0.147    -.0200994    .1330506
_Iliving_c~3 |   .1087023   .0358161     3.04   0.003     .0379174    .1794873
_Iliving_c~4 |   .1136475   .0360829     3.15   0.002     .0423352    .1849597
_Iliving_c~5 |   .1845658   .0626328     2.95   0.004     .0607817    .3083499
district_e~c |   .1207007   .0855145     1.41   0.160    -.0483055    .2897069
frac_ethni~t |   .0153979   .0627753     0.25   0.807    -.1086678    .1394637
 _Iisocode_2 |  -.4171739   .1463513    -2.85   0.005    -.7064146   -.1279332
 _Iisocode_3 |   .0702028   .0830057     0.85   0.399    -.0938452    .2342507
 _Iisocode_4 |  -.4658837   .1332597    -3.50   0.001    -.7292509   -.2025164
 _Iisocode_5 |  -.4341129   .1830713    -2.37   0.019     -.795925   -.0723009
 _Iisocode_6 |   -.253743   .1187386    -2.14   0.034    -.4884115   -.0190745
 _Iisocode_7 |  -.0814668   .0989159    -0.82   0.412    -.2769589    .1140253
 _Iisocode_8 |   .1946282   .1228369     1.58   0.115    -.0481399    .4373963
 _Iisocode_9 |   .2327379   .1159084     2.01   0.046     .0036628    .4618129
_Iisocode_10 |  -.1191258   .1570692    -0.76   0.449    -.4295489    .1912972
_Iisocode_11 |  -.4158045    .103083    -4.03   0.000    -.6195321   -.2120769
_Iisocode_12 |   .2615281   .1592751     1.64   0.103    -.0532546    .5763108
_Iisocode_13 |   .2479013   .1267237     1.96   0.052    -.0025486    .4983511
_Iisocode_14 |  -.1959659   .1220394    -1.61   0.110     -.437158    .0452261
_Iisocode_15 |  -.4190292    .169931    -2.47   0.015    -.7548717   -.0831868
_Iisocode_16 |  -.3162683   .1499491    -2.11   0.037    -.6126196    -.019917
_Iisocode_17 |  (omitted)
malaria_ec~y |  -.0023497   .0040695    -0.58   0.565    -.0103924    .0056931
total_miss~a |  -53.42969   46.67458    -1.14   0.254    -145.6748    38.81542
explorer_c~t |   .0148659    .049409     0.30   0.764    -.0827833    .1125151
railway_co~t |    .027834   .0593998     0.47   0.640    -.0895604    .1452285
cities_140~m |   .0985403   .0650434     1.51   0.132    -.0300079    .2270886
     _Iv30_2 |   .3230843   .1716492     1.88   0.062    -.0161538    .6623224
     _Iv30_3 |   .2042967   .1308254     1.56   0.121    -.0542595    .4628529
     _Iv30_4 |   .2277742   .1497294     1.52   0.130    -.0681428    .5236912
     _Iv30_5 |   .1578262   .1184538     1.33   0.185    -.0762794    .3919317
     _Iv30_6 |   .2407885   .1192546     2.02   0.045     .0051003    .4764768
     _Iv30_7 |   .1502365   .1221602     1.23   0.221    -.0911943    .3916674
     _Iv30_8 |   .2770164   .1477041     1.88   0.063    -.0148979    .5689307
         v33 |  -.0410303   .0236498    -1.73   0.085    -.0877706    .0057099
ln_init_po~y |   .0130396   .0222761     0.59   0.559    -.0309856    .0570648
       _cons |   1.090426   .1851667     5.89   0.000     .7244728     1.45638
------------------------------------------------------------------------------
(5349 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16473
                                                       F( 16,   146) =   70.10
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0931
                                                       Root MSE      =   .9305

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |  -.1454769   .0308047    -4.72   0.000    -.2063577   -.0845961
 _Iisocode_2 |  -.3846524   .1091137    -3.53   0.001    -.6002989    -.169006
 _Iisocode_3 |    .079382   .0684429     1.16   0.248    -.0558848    .2146488
 _Iisocode_4 |   -.412674   .1082146    -3.81   0.000    -.6265433   -.1988046
 _Iisocode_5 |  -.3198706   .0955423    -3.35   0.001    -.5086951    -.131046
 _Iisocode_6 |  -.2532165   .0925391    -2.74   0.007    -.4361057   -.0703273
 _Iisocode_7 |   .0768343   .1011832     0.76   0.449    -.1231388    .2768074
 _Iisocode_8 |   .2737275   .1416954     1.93   0.055    -.0063116    .5537666
 _Iisocode_9 |   .2352907   .1175448     2.00   0.047     .0029816    .4675998
_Iisocode_10 |  -.1903566   .1212629    -1.57   0.119    -.4300141    .0493009
_Iisocode_11 |  -.3599905   .0934283    -3.85   0.000     -.544637    -.175344
_Iisocode_12 |   .7341006   .0723044    10.15   0.000     .5912022    .8769991
_Iisocode_13 |   .2904124   .1080684     2.69   0.008      .076832    .5039929
_Iisocode_14 |  -.2144644   .1276485    -1.68   0.095    -.4667421    .0378132
_Iisocode_15 |  -.4076975   .1262314    -3.23   0.002    -.6571743   -.1582206
_Iisocode_16 |   -.325491   .1082877    -3.01   0.003    -.5395048   -.1114771
_Iisocode_17 |  (omitted)
       _cons |   1.563716   .0955087    16.37   0.000     1.374958    1.752474
------------------------------------------------------------------------------
(5349 missing values generated)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   16473
                                                       F( 19,   146) =   70.89
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1021
                                                       Root MSE      =  .92595

                         (Std. Err. adjusted for 147 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_export_~a |   -.147175   .0305017    -4.83   0.000     -.207457   -.0868931
 _Iisocode_2 |  -.3752836   .1091135    -3.44   0.001    -.5909297   -.1596376
 _Iisocode_3 |   .0647058   .0679553     0.95   0.343    -.0695974    .1990089
 _Iisocode_4 |   -.403671   .1088949    -3.71   0.000    -.6188849   -.1884571
 _Iisocode_5 |  -.3449054   .0956704    -3.61   0.000    -.5339832   -.1558275
 _Iisocode_6 |  -.2629474   .0923374    -2.85   0.005     -.445438   -.0804568
 _Iisocode_7 |   .0471018   .1006174     0.47   0.640     -.151753    .2459565
 _Iisocode_8 |   .2927847   .1415563     2.07   0.040     .0130206    .5725488
 _Iisocode_9 |   .2562597   .1171301     2.19   0.030       .02477    .4877493
_Iisocode_10 |  -.1700991   .1209565    -1.41   0.162     -.409151    .0689529
_Iisocode_11 |  -.3161577   .0934638    -3.38   0.001    -.5008745   -.1314409
_Iisocode_12 |   .7276292   .0723011    10.06   0.000     .5847372    .8705213
_Iisocode_13 |   .2888757   .1087553     2.66   0.009     .0739375    .5038138
_Iisocode_14 |  -.1843657   .1248907    -1.48   0.142    -.4311929    .0624616
_Iisocode_15 |  -.4183962   .1255115    -3.33   0.001    -.6664503   -.1703421
_Iisocode_16 |  -.3044458   .1096521    -2.78   0.006    -.5211563   -.0877353
_Iisocode_17 |  (omitted)
         age |    .016831   .0024115     6.98   0.000     .0120651     .021597
        age2 |  -.0001253   .0000258    -4.85   0.000    -.0001763   -.0000742
        male |   .0278233   .0169754     1.64   0.103    -.0057259    .0613726
       _cons |   1.124321   .1163805     9.66   0.000      .894313    1.354329
------------------------------------------------------------------------------
(5349 missing values generated)
(5349 missing values generated)
(5349 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     diff1_5 |     16473    3.795998           0   3.795998   3.795998
     diff2_5 |     16473    3.594749           0   3.594749   3.594749

. 
. log close
      name:  <unnamed>
       log:  C:\My Dropbox\Afrobarometer\NUNN_WANTCHEKON_AER_2011_REPLICATION_FILES\Altonji_Ratios_Table4.log
  log type:  text
 closed on:  16 Nov 2010, 11:10:54
---------------------------------------------------------------------------------------------------------------------------------
