---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\My Dropbox\Afrobarometer\NUNN_WANTCHEKON_AER_2011_REPLICATION_FILES\Falsification_tests_within_Africa_Tables7_8.l
> og
  log type:  text
 opened on:  16 Nov 2010, 11:09:26

. 
. use "Nunn_Wantchekon_AER_2011.dta", clear

. 
. local baseline_controls "age age2 male urban_dum i.education i.occupation i.religion i.living_conditions district_ethnic_frac f
> rac_ethnicity_in_district i.isocode"

. local colonial_controls "malaria_ecology total_missions_area explorer_contact railway_contact cities_1400_dum i.v30 v33"

. 
. *******************************************
. ** Table 7: Local Council, Columns 1 & 2 **
. *******************************************
. xi: reg trust_local_council distsea i.isocode if missing(religion)!=1 & missing(urban_dum)!=1 & missing(male)!=1 & missing(age)
> !=1, cluster(murdock_name)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   19913
                                                       F( 17,   184) =   71.71
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1602
                                                       Root MSE      =  1.0094

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     distsea |   .0003926   .0000925     4.24   0.000     .0002101    .0005751
 _Iisocode_2 |   .0276636   .1755388     0.16   0.875     -.318664    .3739912
 _Iisocode_3 |  -.0689073   .1697886    -0.41   0.685    -.4038902    .2660756
 _Iisocode_4 |  -.4826524   .1805213    -2.67   0.008    -.8388103   -.1264946
 _Iisocode_5 |    -.00645     .19169    -0.03   0.973    -.3846431    .3717431
 _Iisocode_6 |  -.0787648   .1721826    -0.46   0.648    -.4184709    .2609414
 _Iisocode_7 |   .2280614   .1801136     1.27   0.207     -.127292    .5834149
 _Iisocode_8 |   .5822027   .2028079     2.87   0.005     .1820749    .9823305
 _Iisocode_9 |   .0023613    .174572     0.01   0.989    -.3420588    .3467815
_Iisocode_10 |  -.0604377   .1788369    -0.34   0.736    -.4132721    .2923968
_Iisocode_11 |  -.9098162   .1782885    -5.10   0.000    -1.261569   -.5580635
_Iisocode_12 |   .2856326   .1800763     1.59   0.114    -.0696473    .6409125
_Iisocode_13 |   .5789926   .1740582     3.33   0.001     .2355861    .9223991
_Iisocode_14 |   .1866331   .1817914     1.03   0.306    -.1720306    .5452968
_Iisocode_15 |  -.2522126   .1846983    -1.37   0.174    -.6166113    .1121862
_Iisocode_16 |  -.6960691   .1874379    -3.71   0.000    -1.065873   -.3262652
_Iisocode_17 |  -.6560529   .1736024    -3.78   0.000      -.99856   -.3135457
       _cons |   1.614793   .1698817     9.51   0.000     1.279626    1.949959
------------------------------------------------------------------------------

. xi: reg trust_local_council distsea age age2 male urban_dum i.religion i.isocode, cluster(murdock_name)
i.religion        _Ireligion_0-995    (naturally coded; _Ireligion_0 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)

Linear regression                                      Number of obs =   19913
                                                       F( 38,   184) =   94.45
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1791
                                                       Root MSE      =  .99853

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
trust_loca~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     distsea |   .0003087   .0000753     4.10   0.000       .00016    .0004573
         age |   .0044098   .0027512     1.60   0.111    -.0010182    .0098378
        age2 |  -.0000127     .00003    -0.42   0.673    -.0000719    .0000465
        male |  -.0352815   .0147326    -2.39   0.018     -.064348    -.006215
   urban_dum |   -.255555   .0241681   -10.57   0.000    -.3032372   -.2078728
_Ireligion_2 |   .0211462   .0371969     0.57   0.570    -.0522411    .0945335
_Ireligion_3 |   .0427093   .0350924     1.22   0.225    -.0265259    .1119446
_Ireligion_4 |   .0224381   .0428903     0.52   0.601    -.0621818    .1070581
_Ireligion_5 |   .0635028   .0654119     0.97   0.333    -.0655511    .1925566
_Ireligion_6 |  -.0787486     .06263    -1.26   0.210    -.2023138    .0448167
_Ireligion_7 |   .3116588   .3365426     0.93   0.356    -.3523197    .9756373
_Ireligio~10 |  -.0439161   .0412721    -1.06   0.289    -.1253435    .0375114
_Ireligio~11 |   .2220788   .0550756     4.03   0.000      .113418    .3307397
_Ireligio~12 |   .1948863    .066727     2.92   0.004     .0632378    .3265347
_Ireligio~13 |  -.1361793   .0915654    -1.49   0.139    -.3168323    .0444737
_Ireligio~14 |  -.1162699   .0623002    -1.87   0.064    -.2391846    .0066447
_Ireligio~15 |    .025131   .0785484     0.32   0.749    -.1298402    .1801023
_Ireligi~360 |   .5936765   .0886755     6.69   0.000      .418725    .7686279
_Ireligi~361 |   .4574888   .1222219     3.74   0.000     .2163522    .6986253
_Ireligi~362 |   1.073552   .1404192     7.65   0.000     .7965133    1.350591
_Ireligi~363 |   .7067757   .1106572     6.39   0.000     .4884557    .9250958
_Ireligi~995 |   .0569018   .1190793     0.48   0.633    -.1780346    .2918383
 _Iisocode_2 |   .1129788   .1407758     0.80   0.423    -.1647635    .3907212
 _Iisocode_3 |   -.045046   .1372721    -0.33   0.743    -.3158756    .2257836
 _Iisocode_4 |   -.462592   .1442192    -3.21   0.002     -.747128    -.178056
 _Iisocode_5 |   -.020432   .1598818    -0.13   0.898    -.3358693    .2950053
 _Iisocode_6 |  -.1151634    .139232    -0.83   0.409    -.3898599     .159533
 _Iisocode_7 |   .0631727   .1537669     0.41   0.682    -.2402003    .3665457
 _Iisocode_8 |   .5986651   .1605472     3.73   0.000     .2819151    .9154151
 _Iisocode_9 |  -.0312526   .1446553    -0.22   0.829    -.3166489    .2541438
_Iisocode_10 |  -.0072799   .1399846    -0.05   0.959    -.2834612    .2689014
_Iisocode_11 |  -.8648373   .1397435    -6.19   0.000    -1.140543   -.5891317
_Iisocode_12 |  -.1913227   .1853637    -1.03   0.303    -.5570343    .1743889
_Iisocode_13 |   .5663231   .1396648     4.05   0.000     .2907727    .8418734
_Iisocode_14 |   .2280946   .1449393     1.57   0.117     -.057862    .5140512
_Iisocode_15 |  -.1728375    .151958    -1.14   0.257    -.4726416    .1269665
_Iisocode_16 |  -.5872765   .1527635    -3.84   0.000    -.8886699   -.2858832
_Iisocode_17 |  -.6033164    .138266    -4.36   0.000     -.876107   -.3305257
       _cons |   1.566207   .1436334    10.90   0.000     1.282827    1.849587
------------------------------------------------------------------------------

. 
. ***********************************************
. ** Table 8: Inter-group trust, Columns 1 & 2 **
. ***********************************************
. xi: reg inter_group_trust distsea i.isocode if missing(occupation)!=1 & missing(urban_dum)!=1 & missing(male)!=1 & missing(age)
> !=1, cluster(murdock_name)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19970
                                                       F( 16,   184) =   81.74
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0893
                                                       Root MSE      =  .94978

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     distsea |   .0003877    .000128     3.03   0.003     .0001352    .0006402
 _Iisocode_2 |  -.1859289    .134742    -1.38   0.169    -.4517668     .079909
 _Iisocode_3 |   .1575246   .1237611     1.27   0.205    -.0866487     .401698
 _Iisocode_4 |  -.1429647   .1290309    -1.11   0.269     -.397535    .1116056
 _Iisocode_5 |  -.0622752    .138935    -0.45   0.655    -.3363857    .2118352
 _Iisocode_6 |   .0838808   .1273542     0.66   0.511    -.1673815     .335143
 _Iisocode_7 |   .2148042   .1528457     1.41   0.162    -.0867513    .5163598
 _Iisocode_8 |   .5028877   .1450967     3.47   0.001     .2166206    .7891548
 _Iisocode_9 |   .4643981   .1359385     3.42   0.001     .1961994    .7325967
_Iisocode_10 |   .0721318   .1322255     0.55   0.586    -.1887412    .3330048
_Iisocode_11 |  -.2341644   .1494879    -1.57   0.119    -.5290952    .0607663
_Iisocode_12 |   .9658102   .1227995     7.86   0.000     .7235342    1.208086
_Iisocode_13 |   .5242695   .1361528     3.85   0.000     .2556481    .7928909
_Iisocode_14 |  -.1034074   .1865486    -0.55   0.580    -.4714568    .2646419
_Iisocode_15 |  -.0143674   .1433359    -0.10   0.920    -.2971605    .2684257
_Iisocode_16 |  -.1579019   .1558757    -1.01   0.312    -.4654353    .1496315
_Iisocode_17 |  (omitted)
       _cons |    1.10216   .1240791     8.88   0.000     .8573596    1.346961
------------------------------------------------------------------------------

. xi: reg inter_group_trust distsea age age2 male urban_dum i.occupation i.isocode, cluster(murdock_name)
i.occupation      _Ioccupatio_0-995   (naturally coded; _Ioccupatio_0 omitted)
i.isocode         _Iisocode_1-17      (_Iisocode_1 for isocode==BEN omitted)
note: _Iisocode_17 omitted because of collinearity

Linear regression                                      Number of obs =   19970
                                                       F( 45,   184) =   60.59
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1026
                                                       Root MSE      =  .94349

                         (Std. Err. adjusted for 185 clusters in murdock_name)
------------------------------------------------------------------------------
             |               Robust
inter_grou~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     distsea |   .0003669   .0001186     3.09   0.002      .000133    .0006008
         age |   .0160287   .0024619     6.51   0.000     .0111715    .0208859
        age2 |  -.0001254   .0000253    -4.95   0.000    -.0001754   -.0000754
        male |   .0486459   .0152025     3.20   0.002     .0186523    .0786395
   urban_dum |  -.0812124   .0287078    -2.83   0.005    -.1378512   -.0245736
_Ioccupat~_1 |   -.040747   .0417252    -0.98   0.330    -.1230683    .0415742
_Ioccupat~_2 |  -.0609517   .0453998    -1.34   0.181    -.1505228    .0286193
_Ioccupat~_3 |  -.0996046     .08665    -1.15   0.252    -.2705599    .0713508
_Ioccupat~_4 |  -.0443421   .0564444    -0.79   0.433    -.1557036    .0670195
_Ioccupat~_5 |  -.0465294   .0973585    -0.48   0.633    -.2386119    .1455531
_Ioccupat~_6 |  -.1008174   .0401663    -2.51   0.013    -.1800632   -.0215716
_Ioccupati~7 |  -.0407665    .052934    -0.77   0.442    -.1452021    .0636691
_Ioccupat~_8 |  -.1075147   .0581452    -1.85   0.066    -.2222318    .0072024
_Ioccupat~_9 |  -.1339699   .0708406    -1.89   0.060    -.2737342    .0057944
_Ioccupat~10 |   .0120665   .0549148     0.22   0.826    -.0962772    .1204102
_Ioccupat~11 |  -.1197846    .047292    -2.53   0.012    -.2130888   -.0264804
_Ioccupat~12 |  -.1160834   .0617643    -1.88   0.062    -.2379407    .0057738
_Ioccupat~13 |  -.0656329   .0590026    -1.11   0.267    -.1820415    .0507758
_Ioccupat~14 |  -.1316163   .0458124    -2.87   0.005    -.2220015   -.0412312
_Ioccupat~15 |  -.2353989     .06186    -3.81   0.000     -.357445   -.1133528
_Ioccupat~16 |   .0152927   .0501609     0.30   0.761    -.0836717    .1142571
_Ioccupat~18 |   -.135135   .0481401    -2.81   0.006    -.2301126   -.0401574
_Ioccupat~19 |  -.1120025   .0814881    -1.37   0.171    -.2727737    .0487686
_Ioccupat~20 |  -.0518947   .0480505    -1.08   0.282    -.1466956    .0429061
_Ioccupat~21 |  -.0745662    .058899    -1.27   0.207    -.1907704    .0416381
_Ioccupat~22 |  -.1369603    .069906    -1.96   0.052    -.2748806      .00096
_Ioccupat~23 |  -.1396686   .0341262    -4.09   0.000    -.2069976   -.0723396
_Ioccupat~24 |  -.0157993   .0429999    -0.37   0.714    -.1006356     .069037
_Ioccupat~25 |   .1287614   .2072377     0.62   0.535    -.2801064    .5376291
_Ioccupa~995 |   .0453009   .1023381     0.44   0.659    -.1566062    .2472079
 _Iisocode_2 |  -.1865696    .127614    -1.46   0.145    -.4383444    .0652052
 _Iisocode_3 |   .1506659   .1184177     1.27   0.205    -.0829652     .384297
 _Iisocode_4 |  -.1538895   .1228222    -1.25   0.212    -.3962104    .0884314
 _Iisocode_5 |  -.1052566   .1305904    -0.81   0.421    -.3629037    .1523904
 _Iisocode_6 |   .0489136   .1226564     0.40   0.691    -.1930801    .2909074
 _Iisocode_7 |   .1737064   .1428882     1.22   0.226    -.1082035    .4556163
 _Iisocode_8 |   .4982515   .1406827     3.54   0.001      .220693    .7758101
 _Iisocode_9 |   .4449964   .1312288     3.39   0.001     .1860898    .7039029
_Iisocode_10 |   .0793289    .125737     0.63   0.529    -.1687428    .3274006
_Iisocode_11 |  -.1822292   .1405182    -1.30   0.196    -.4594632    .0950049
_Iisocode_12 |   .9446933   .1147422     8.23   0.000     .7183137    1.171073
_Iisocode_13 |   .5012272   .1317745     3.80   0.000     .2412439    .7612106
_Iisocode_14 |  -.0814503   .1738198    -0.47   0.640    -.4243863    .2614858
_Iisocode_15 |  -.0335996   .1403466    -0.24   0.811    -.3104951    .2432959
_Iisocode_16 |  -.1426978   .1482631    -0.96   0.337    -.4352121    .1498165
_Iisocode_17 |  (omitted)
       _cons |   .7971317   .1326831     6.01   0.000     .5353557    1.058908
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\My Dropbox\Afrobarometer\NUNN_WANTCHEKON_AER_2011_REPLICATION_FILES\Falsification_tests_within_Africa_Tables7_8.l
> og
  log type:  text
 closed on:  16 Nov 2010, 11:09:28
---------------------------------------------------------------------------------------------------------------------------------
